{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "Hii",
        "Hiii",
        "hai",
        "haii",
        "haiiii",
        "hello",
        "helloo",
        "helo",
        "hellooo",
        "heyyyy",
        "Who are you?"
        
      ],
      "responses": [
        "Hey! My name is Future Forge I can give you job Recommendations, Tell me the Course, I will provide you the recommended jobs Based on the course."
      ]
    },
    {
      "tag": "Asking",
      "patterns": [
        "How are you?",
        "How you doing"
      ],
        "responses": [
          "Thanks for asking,I'm doing good how can I help you?!"
        ]
    },
    
        
    {
      "tag": "Owner",
      "patterns": [
        "Who created you?",
        "What can do you do?",
        "What is your name?"
        
      ],
      "responses": [
        "Hey! Thanks for asking, My name is Future Forge your job recommender. I'm was created by Selvan, Sreeraam, Sudarsan. Tell me the course name"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": ["Bye", "See you later", "Goodbye"],
      "responses": [
        "See you later, thanks for visiting",
        "Have a nice day",
        "Bye! Come back again soon."
      ]
    },
    {
      "tag": "thanks",
      "patterns": ["Thankssss", "Thank you", "That's helpful", "Thank's a lot!","tqsm","thank u"],
      "responses": ["Happy to help!", "Any time!", "My pleasure"]
    },
    {
      "tag": "tenth_twelfth_fail_jobs",
      "patterns": [
        "Career options for 10th fail students",
        "Career options for 12th fail students",
        "Job opportunities without completing 10th grade",
        "Jobs for individuals who haven't completed 10th",
        "Jobs for individuals who haven't completed 12th",
        "jobs for 10th fail students",
        "jobs for 12th fail students",
        "10th fail students",
        "12th fail students"
      ],
      "responses": [
        "For individuals who haven't completed 10th or 12th grade, there are still several career options available: SKILLED TRADES: Explore vocational training in carpentry, plumbing, or electrical work. Skills required: Technical skills, ability to follow instructions, physical stamina. RETAIL JOBS: Opportunities in retail, such as sales, cashier, or customer service roles. Skills required: Communication skills, customer service skills, basic math skills. ENTREPRENEURSHIP: Consider starting a small business based on your skills or interests. Skills required: Business acumen, creativity, resilience. APPRENTICESHIPS: Look for apprenticeship programs in various industries. Skills required: Willingness to learn, hands-on skills, attention to detail. FREELANCING: Explore freelancing opportunities in areas like writing, graphic design, or online services. Skills required: Specialized skills related to the freelancing field, self-discipline, time management. It's important to focus on developing skills and finding a path that aligns with your strengths and interests."
      ]
    },
    {
      "tag": "it_jobs",
      "patterns": [
        "Job opportunities after completing Information Technology",
        "Career options with IT degree",
        "Jobs after IT",
        "be it",
        "b.tech it",
        "btech it",
        "b.tech information technology",
        "btech information technology",
        "b.e information technology",
        "be information technology",
        "b.e it"
      ],
      "responses": [
        "After completing Information Technology, you can explore various job opportunities: SOFTWARE DEVELOPER: Average Salary(LPA) Rs.6,50,000, 1-3 years of experience. Skills required: Proficiency in programming languages such as Java, Python, or C++, understanding of software development lifecycle, problem-solving skills. SYSTEMS ANALYST: Average Salary(LPA) Rs.6,80,000, 2-4 years of experience. Skills required: Analytical skills, knowledge of information systems, communication skills, understanding of business processes. NETWORK ADMINISTRATOR: Average Salary(LPA) Rs.6,20,000, 2-4 years of experience. Skills required: Knowledge of networking protocols, troubleshooting skills, familiarity with network hardware. DATABASE ADMINISTRATOR: Average Salary(LPA) Rs.6,90,000, 2-4 years of experience. Skills required: Proficiency in database management systems like MySQL or Oracle, SQL querying skills, attention to detail. IT CONSULTANT: Average Salary(LPA) Rs.7,00,000, 2-5 years of experience. Skills required: Consulting skills, project management skills, knowledge of IT infrastructure, problem-solving abilities. These figures are approximate and may vary based on location and individual factors."
      ]
    },    
    {
      "tag": "ece_jobs",
      "patterns": [
        "Job opportunities after completing Electronics and Communication Engineering",
        "Career options with ECE degree",
        "Jobs after ECE",
        "be ece jobs",
        "b.e ece",
        "be ece",
        "btech ece",
        "b.tech ece",
        "b.e ece jobs",
        "be Electronics and Communication Engineering jobs"
      ],
      "responses": [
        "After completing Electronics and Communication Engineering, you can explore various job opportunities: ELECTRONICS ENGINEER: Average Salary(LPA) Rs.7,00,000, 2-4 years of experience. Skills required: Knowledge of electronic circuits and components, proficiency in electronics design software like Altium or Eagle, problem-solving abilities. COMMUNICATIONS ENGINEER: Average Salary(LPA) Rs.7,20,000, 2-4 years of experience. Skills required: Understanding of communication systems, knowledge of modulation techniques, familiarity with communication protocols, analytical skills. HARDWARE DESIGN ENGINEER: Average Salary(LPA) Rs.7,50,000, 3-5 years of experience. Skills required: Hardware design skills, familiarity with PCB design tools, knowledge of digital and analog circuit design, attention to detail. NETWORK ENGINEER: Average Salary(LPA) Rs.6,80,000, 2-4 years of experience. Skills required: Networking skills, understanding of network protocols, troubleshooting abilities, knowledge of network hardware. SIGNAL PROCESSING ENGINEER: Average Salary(LPA) Rs.7,80,000, 3-6 years of experience. Skills required: Signal processing skills, proficiency in MATLAB or other signal processing tools, knowledge of digital signal processing algorithms, problem-solving abilities. These figures are approximate and may vary based on location and individual factors."
      ]
    },
    {
      "tag": "mechanical_engineering_jobs",
      "patterns": [
        "Job opportunities after completing Mechanical Engineering",
        "Career options with Mechanical Engineering degree",
        "Jobs after Mechanical Engineering",
        "be mechanical engineering",
        "b.e mechanical engineering",
        "be mech jobs",
        "b.e mech jobs",
        "btech mechanical",
        "b.tech mechanical",
        "b.e mechanical engineering",
        "btech mechanical engineering",
        "b.tech mechanical engineering"
      ],
      "responses": [
        "After completing Mechanical Engineering, you can explore various job opportunities: MECHANICAL ENGINEER: Average Salary(LPA) Rs.7,00,000, 2-5 years of experience. Skills required: Knowledge of mechanical systems and principles, proficiency in CAD software like AutoCAD or SolidWorks, problem-solving abilities. DESIGN ENGINEER: Average Salary(LPA) Rs.7,50,000, 3-6 years of experience. Skills required: Design skills, familiarity with engineering drawings and specifications, creativity, attention to detail. MANUFACTURING ENGINEER: Average Salary(LPA) Rs.8,00,000, 3-5 years of experience. Skills required: Manufacturing process knowledge, understanding of production techniques, quality management skills, communication skills. AUTOMATION ENGINEER: Average Salary(LPA) Rs.6,80,000, 2-4 years of experience. Skills required: Automation skills, familiarity with PLC programming, knowledge of industrial control systems, troubleshooting abilities. PROJECT ENGINEER: Average Salary(LPA) Rs.7,80,000, 3-6 years of experience. Skills required: Project management skills, ability to oversee engineering projects, coordination skills, budget management abilities. These figures are approximate and may vary based on location and individual factors."
      ]
    },    
    {
      "tag": "automobile_engineering_jobs",
      "patterns": [
        "Job opportunities after completing B.Tech in Automobile Engineering",
        "Career options with Automobile Engineering degree",
        "Jobs after Automobile Engineering jobs",
        "b.e Automobile Engineering",
        "be Automobile Engineering",
        "b.tech Automobile Engineering",
        "btech Automobile Engineering"
      ],
      "responses": [
        "After completing B.Tech in Automobile Engineering, you can explore various job opportunities: AUTOMOBILE ENGINEER: Average Salary Rs.7,50,000 per annum, 2-5 years of experience. Skills required: Knowledge of automobile systems and components, proficiency in CAD software, problem-solving abilities, understanding of vehicle dynamics. AUTOMOTIVE DESIGN ENGINEER: Average Salary Rs.8,00,000 per annum, 3-6 years of experience. Skills required: Design skills, familiarity with engineering drawings and specifications, creativity, attention to detail. VEHICLE DYNAMICS ENGINEER: Average Salary Rs.7,80,000 per annum, 2-4 years of experience. Skills required: Knowledge of vehicle dynamics, understanding of vehicle performance parameters, proficiency in simulation tools like MATLAB/Simulink. AUTOMOBILE SERVICE MANAGER: Average Salary Rs.7,00,000 per annum, 2-4 years of experience. Skills required: Customer service skills, team management abilities, knowledge of automobile maintenance procedures, communication skills. AUTOMOTIVE TESTING ENGINEER: Average Salary Rs.8,50,000 per annum, 3-6 years of experience. Skills required: Testing skills, familiarity with testing equipment and procedures, attention to detail, analytical abilities. These figures are approximate and may vary based on location and individual factors."
      ]
    },

    {
      "tag": "cse_jobs",
      "patterns": [
        "Job opportunities after completing Computer Science Engineering",
        "Career options with CSE degree",
        "Jobs after CSE",
        "be cse",
        "b.e cse",
        "btech cs",
        "b.tech cs",
        "btech computer science engineering",
        "b.tech computer science engineering",
        "be computer science jobs",
        "b.e computer science engineering",
        "be computer science engineering"
      ],
      "responses": [
        "After completing Computer Science Engineering, you can explore various job opportunities: SOFTWARE ENGINEER: Average Salary(LPA) Rs.7,50,000, 2-5 years of experience. Skills required: Proficiency in programming languages like Java, Python, or C++, understanding of software development methodologies, problem-solving abilities, teamwork skills. DATA SCIENTIST: Average Salary(LPA) Rs.8,50,000, 3-6 years of experience. Skills required: Data analysis skills, proficiency in statistical analysis tools like Python or R, knowledge of machine learning algorithms, data visualization skills. CYBERSECURITY ANALYST: Average Salary(LPA) Rs.8,00,000, 3-5 years of experience. Skills required: Knowledge of cybersecurity principles, familiarity with security tools and technologies, understanding of network protocols, analytical skills. WEB DEVELOPER: Average Salary(LPA) Rs.7,00,000, 2-4 years of experience. Skills required: Proficiency in web development technologies like HTML, CSS, JavaScript, knowledge of web frameworks like React or Angular, creativity in design and problem-solving. IT PROJECT MANAGER: Average Salary(LPA) Rs.9,00,000, 4-7 years of experience. Skills required: Project management skills, leadership abilities, communication skills, risk management expertise, knowledge of software development lifecycle. These figures are approximate and may vary based on location and individual factors."
      ]
    },
    {
      "tag": "chemical_engineering_jobs",
      "patterns": [
        "Job opportunities after completing Chemical Engineering",
        "Career options with Chemical Engineering degree",
        "Jobs after Chemical Engineering",
        "be chemical engineering jobs",
        "btech chemical",
        "b.tech chemical",
        "btech chemical engineering",
        "b.tech chemical engineering jobs"
      ],
      "responses": [
        "After completing Chemical Engineering, you can explore various job opportunities: CHEMICAL ENGINEER: Average Salary(LPA) Rs.7,20,000, 2-5 years of experience. Skills required: Knowledge of chemical processes, ability to design and troubleshoot chemical systems, proficiency in process simulation software, strong analytical skills, attention to detail. PROCESS ENGINEER: Average Salary(LPA) Rs.7,80,000, 3-6 years of experience. Skills required: Understanding of process engineering principles, familiarity with equipment design and operation, problem-solving abilities, teamwork skills. PETROLEUM ENGINEER: Average Salary(LPA) Rs.8,50,000, 3-5 years of experience. Skills required: Knowledge of oil and gas extraction processes, proficiency in reservoir engineering, understanding of drilling and production techniques, analytical skills. RESEARCH SCIENTIST: Average Salary(LPA) Rs.8,00,000, 2-4 years of experience. Skills required: Strong research skills, ability to conduct experiments and analyze data, proficiency in scientific methodologies, attention to detail. ENVIRONMENTAL ENGINEER: Average Salary(LPA) Rs.7,50,000, 3-6 years of experience. Skills required: Knowledge of environmental regulations, ability to design and implement pollution control systems, proficiency in environmental impact assessments, communication skills. These figures are approximate and may vary based on location and individual factors."
      ]
    },
    {
      "tag": "bsc_forensics_jobs",
      "patterns": [
        "Job opportunities after completing B.Sc in Forensics",
        "Career options with Forensics degree",
        "Forensic science jobs",
        "bsc forensics jobs"
      ],
      "responses": [
        "After completing B.Sc in Forensics, you can explore various job opportunities: FORENSIC SCIENTIST: Average Salary(LPA) Rs.5,50,000, 1-3 years of experience. Skills required: Knowledge of forensic techniques, attention to detail, analytical skills, ability to interpret data, proficiency in laboratory procedures. CRIME SCENE INVESTIGATOR: Average Salary(LPA) Rs.5,80,000, 2-4 years of experience. Skills required: Crime scene analysis, evidence collection and preservation, investigative techniques, report writing. FORENSIC TOXICOLOGIST: Average Salary(LPA) Rs.6,20,000, 2-4 years of experience. Skills required: Understanding of toxicology principles, proficiency in analyzing biological samples, knowledge of drug metabolism, attention to detail. DIGITAL FORENSIC ANALYST: Average Salary(LPA) Rs.6,50,000, 2-5 years of experience. Skills required: Knowledge of digital forensic tools, proficiency in data recovery and analysis, understanding of computer networks, problem-solving abilities. FORENSIC PATHOLOGIST: Average Salary(LPA) Rs.6,80,000, 3-6 years of experience. Skills required: Medical expertise, ability to perform autopsies, understanding of forensic pathology principles, attention to detail. These figures are approximate and may vary based on location and individual factors."
      ]
    },
    {
      "tag": "mph_jobs",
      "patterns": [
        "Job opportunities after completing Master of Public Health",
        "Career options with MPH degree",
        "Jobs after MPH"
      ],
      "responses": [
        "After completing Master of Public Health, you can explore various job opportunities: PUBLIC HEALTH ANALYST: Average Salary Rs.9,00,000 per annum, 4-7 years of experience. Skills required: Data analysis, epidemiological research, public health policy analysis, communication skills, project management. HEALTH POLICY ADVISOR: Average Salary Rs.8,50,000 per annum, 3-5 years of experience. Skills required: Knowledge of healthcare policy, policy analysis, advocacy skills, research abilities, communication skills. EPIDEMIOLOGIST: Average Salary Rs.8,80,000 per annum, 3-6 years of experience. Skills required: Epidemiological research methods, data analysis, statistical analysis, communication skills, report writing. HEALTHCARE CONSULTANT: Average Salary Rs.9,50,000 per annum, 4-6 years of experience. Skills required: Healthcare industry knowledge, consulting skills, project management, problem-solving abilities, communication skills. COMMUNITY HEALTH MANAGER: Average Salary Rs.10,00,000 per annum, 5-8 years of experience. Skills required: Community health program management, leadership skills, strategic planning, stakeholder engagement, budgeting and finance management. These figures are approximate and may vary based on location and individual factors."
      ]
    },
    {
      "tag": "ma_film_tv_production_jobs",
      "patterns": [
        "Job opportunities after completing MA in Film and Television Production",
        "Career options with MA Film and Television Production degree",
        "MA Film and Television Production"
      ],
      "responses": [
        "After completing MA in Film and Television Production, you can explore various job opportunities: FILM PRODUCER: Average Salary Rs.10,00,000 per annum, 5-8 years of experience. Skills required: Project management, budgeting, negotiation skills, leadership abilities, creative vision. CINEMATOGRAPHER: Average Salary Rs.9,50,000 per annum, 4-7 years of experience. Skills required: Cinematography techniques, camera operation, lighting, composition, storytelling. VIDEO EDITOR: Average Salary Rs.8,80,000 per annum, 3-6 years of experience. Skills required: Video editing software proficiency, storytelling, attention to detail, creativity, time management. PRODUCTION DESIGNER: Average Salary Rs.9,20,000 per annum, 4-6 years of experience. Skills required: Set design, art direction, visualization, creativity, collaboration. SCRIPTWRITER: Average Salary Rs.8,50,000 per annum, 3-5 years of experience. Skills required: Screenwriting, storytelling, creativity, character development, dialogue writing. These figures are approximate and may vary based on location and individual factors."
      ]
    },

    {
      "tag": "mdes_film_design_jobs",
      "patterns": [
        "Job opportunities after completing M.Des in Film Design",
        "Career options with M.Des Film Design degree",
        "Jobs after M.Des Film Design",
        "MDes Film Design"
      ],
      "responses": [
        "After completing M.Des in Film Design, you can explore various job opportunities: FILM ART DIRECTOR: Average Salary Rs.10,50,000 per annum, 5-8 years of experience. Skills required: Visual storytelling, art direction, creative vision, collaboration, leadership. VISUAL EFFECTS (VFX) ARTIST: Average Salary Rs.9,80,000 per annum, 4-7 years of experience. Skills required: VFX software proficiency, creative problem-solving, attention to detail, teamwork. ANIMATION DIRECTOR: Average Salary Rs.9,20,000 per annum, 3-6 years of experience. Skills required: Animation techniques, storytelling, leadership, collaboration, creativity. STORYBOARD ARTIST: Average Salary Rs.8,50,000 per annum, 3-5 years of experience. Skills required: Storytelling, sketching, visual communication, attention to detail, creativity. FILM GRAPHIC DESIGNER: Average Salary Rs.9,00,000 per annum, 4-6 years of experience. Skills required: Graphic design, typography, layout, branding, software proficiency. These figures are approximate and may vary based on location and individual factors."
      ]
    },
    {
      "tag": "msc_cinematography_jobs",
      "patterns": [
        "Job opportunities after completing M.Sc. in Cinematography",
        "Career options with M.Sc. Cinematography degree",
        "M.Sc Cinematography",
        "MSc Cinematography"
      ],
      "responses": [
        "After completing M.Sc. in Cinematography, you can explore various job opportunities: DIRECTOR OF PHOTOGRAPHY: Average Salary Rs.9,50,000 per annum, 4-7 years of experience. Skills required: Cinematography techniques, lighting setup, camera operation, storytelling, attention to detail. CINEMA TECHNICIAN: Average Salary Rs.8,80,000 per annum, 3-6 years of experience. Skills required: Film equipment operation, technical troubleshooting, teamwork, communication. FILM EDITOR: Average Salary Rs.8,50,000 per annum, 3-5 years of experience. Skills required: Video editing software proficiency, storytelling, attention to detail, creativity. LIGHTING TECHNICIAN: Average Salary Rs.8,20,000 per annum, 2-4 years of experience. Skills required: Lighting setup, technical knowledge of lighting equipment, teamwork, problem-solving. COLORIST: Average Salary Rs.9,00,000 per annum, 4-6 years of experience. Skills required: Color grading software proficiency, artistic vision, attention to detail, collaboration. These figures are approximate and may vary based on location and individual factors."
      ]
    },
    {
      "tag": "mft_cinematography_jobs",
      "patterns": [
        "Job opportunities after completing M.F.Tech Cinematography",
        "Career options with MFTech Cinematography degree",
        "MFTech Cinematography"
      ],
      "responses": [
        "After completing M.F.Tech Cinematography, you can explore various job opportunities: DIRECTOR OF PHOTOGRAPHY: Average Salary Rs.10,00,000 per annum, 5-8 years of experience. Skills Required: Excellent understanding of cinematography techniques, strong leadership and communication skills, proficiency in camera operation and lighting setup. CINEMATOGRAPHY SUPERVISOR: Average Salary Rs.9,50,000 per annum, 4-7 years of experience. Skills Required: Advanced knowledge of cinematography principles, experience in supervising camera and lighting teams, attention to detail. CAMERA OPERATOR: Average Salary Rs.8,80,000 per annum, 3-6 years of experience. Skills Required: Proficiency in operating various types of cameras, ability to frame shots creatively, good coordination with the director and cinematographer. LIGHTING TECHNICIAN: Average Salary Rs.8,50,000 per annum, 3-5 years of experience. Skills Required: Strong understanding of lighting techniques, knowledge of electrical systems, ability to work in a team environment. FILM COLORIST: Average Salary Rs.9,20,000 per annum, 4-6 years of experience. Skills Required: Proficiency in color grading software, understanding of color theory, attention to detail in adjusting color and tone."
      ]
    },    


    {
      "tag": "civil_engineering_jobs",
      "patterns": [
        "Job opportunities after completing Civil Engineering",
        "Career options with Civil Engineering degree",
        "Jobs after Civil Engineering",
        "be civil jobs",
        "b.e civil engineering",
        "be civil engineering jobs",
        "b.tech civil engineering",
        "btech civil engineering"
      ],
      "responses": [
        "After completing Civil Engineering, you can explore various job opportunities: CIVIL ENGINEER: Average Salary(LPA) Rs.7,00,000, 2-5 years of experience. Skills required: Structural analysis, construction management, project planning, AutoCAD proficiency. STRUCTURAL ENGINEER: Average Salary(LPA) Rs.7,50,000, 3-6 years of experience. Skills required: Structural design, analysis software proficiency, attention to detail, problem-solving. PROJECT MANAGER (CIVIL): Average Salary(LPA) Rs.8,00,000, 3-5 years of experience. Skills required: Project management, communication, leadership, budgeting. GEOTECHNICAL ENGINEER: Average Salary(LPA) Rs.6,80,000, 2-4 years of experience. Skills required: Soil mechanics, foundation engineering, site investigation, report writing. CONSTRUCTION MANAGER: Average Salary(LPA) Rs.7,80,000, 3-6 years of experience. Skills required: Construction management, scheduling, resource allocation, risk management. These figures are approximate and may vary based on location and individual factors."
      ]
    },
    {
      "tag": "instrumentation_control_engineering_jobs",
      "patterns": [
        "Job opportunities after completing B.Tech in Instrumentation and Control Engineering",
        "Career options with Instrumentation and Control Engineering degree",
        "Jobs after Instrumentation and Control Engineering",
        "b.tech instrumentation and control engineering jobs",
        "btech instrumentation and control engineering jobs",
        "b.e instrumentation and control engineering jobs",
        "be instrumentation and control engineering jobs",
        "be ic",
        "b.e ic",
        "b.tech ic jobs",
        "btech ic jobs"
      ],
      "responses": [
        "After completing B.Tech in Instrumentation and Control Engineering, you can explore various job opportunities: INSTRUMENTATION ENGINEER: Average Salary(LPA) Rs.7,50,000, 2-5 years of experience. Skills required: Control systems, sensor technologies, data acquisition, PLC programming. CONTROL SYSTEMS ENGINEER: Average Salary(LPA) Rs.8,00,000, 3-6 years of experience. Skills required: System modeling, feedback control theory, PID tuning, SCADA systems. AUTOMATION ENGINEER: Average Salary(LPA) Rs.7,80,000, 2-4 years of experience. Skills required: PLC programming, HMI design, industrial networks, robotic systems. PROCESS CONTROL ENGINEER: Average Salary(LPA) Rs.7,00,000, 2-4 years of experience. Skills required: Process dynamics, control loop tuning, DCS systems, plant optimization. INDUSTRIAL AUTOMATION CONSULTANT: Average Salary(LPA) Rs.8,50,000, 3-6 years of experience. Skills required: Project management, technical consulting, solution architecture, client communication. These figures are approximate and may vary based on location and individual factors."
      ]
    },
    {
      "tag": "mbbs_jobs",
      "patterns": [
        "Job opportunities after completing MBBS",
        "Career options with MBBS degree",
        "Jobs after MBBS",
        "mbbs jobs",
        "mbbs",
        "Bachelor of Medicine and Bachelor of Surgery jobs",
        "doctor course jobs"
      ],
      "responses": [
        "After completing MBBS, you can explore various job opportunities: DOCTOR: Average Salary Rs.10,00,000 per annum, 2-5 years of experience. Required skills: Medical knowledge, diagnostic skills, empathy, communication skills, ability to work under pressure. SURGEON: Average Salary Rs.15,00,000 per annum, 4-8 years of experience. Required skills: Surgical skills, precision, attention to detail, decision-making skills, ability to handle emergencies. MEDICAL RESEARCHER: Average Salary Rs.12,00,000 per annum, 3-6 years of experience. Required skills: Research skills, analytical skills, scientific knowledge, attention to detail, critical thinking. HEALTH ADMINISTRATOR: Average Salary Rs.8,00,000 per annum, 2-5 years of experience. Required skills: Management skills, organizational skills, leadership abilities, communication skills, knowledge of healthcare systems. These figures are approximate and may vary based on location and individual factors."  
      ]
    },
    
    {
      "tag": "bds_jobs",
      "patterns": [
        "Job opportunities after completing BDS",
        "Career options with BDS degree",
        "Jobs after BDS",
        "bds jobs",
        "bachelor of dental surgery jobs",
        "dental jobs",
        "dentist jobs"
      ],
      "responses": [
        "After completing BDS, you can explore various job opportunities: DENTIST: Average Salary Rs.7,00,000 per annum, 2-5 years of experience. Required skills: Dental procedures, patient care, communication skills, attention to detail. ORAL SURGEON: Average Salary Rs.8,00,000 per annum, 3-6 years of experience. Required skills: Surgical skills, dental procedures, precision, empathy. DENTAL HYGIENIST: Average Salary Rs.6,50,000 per annum, 1-3 years of experience. Required skills: Dental hygiene practices, patient education, communication skills. DENTAL CONSULTANT: Average Salary Rs.7,50,000 per annum, 2-4 years of experience. Required skills: Dental expertise, consulting skills, problem-solving abilities. DENTAL RESEARCHER: Average Salary Rs.8,50,000 per annum, 4-7 years of experience. Required skills: Research skills, scientific knowledge, analytical abilities, attention to detail. These figures are approximate and may vary based on location and individual factors."
      ]
    },
    
    {
      "tag": "bams_jobs",
      "patterns": [
        "Job opportunities after completing BAMS",
        "Career options with BAMS degree",
        "Jobs after BAMS",
        "bams jobs",
        "Bachelor of Ayurvedic Medicine and Surgery jobs",
        "ayurvedic jobs",
        "ayurveda"
      ],
      "responses": [
        "After completing BAMS, you can explore various job opportunities: AYURVEDIC DOCTOR: Average Salary(LPA) Rs.6,00,000, 2-4 years of experience. Skills required: Medical knowledge, diagnostic skills, knowledge of Ayurvedic principles and treatments, empathy, communication skills. AYURVEDIC CONSULTANT: Average Salary(LPA) Rs.5,50,000, 1-3 years of experience. Skills required: Consultation skills, Ayurvedic treatment planning, patient education, communication skills. RESEARCHER IN AYURVEDA: Average Salary(LPA) Rs.6,50,000, 2-4 years of experience. Skills required: Research skills, knowledge of Ayurvedic research methodologies, data analysis, scientific writing. AYURVEDIC PHARMACIST: Average Salary(LPA) Rs.5,00,000, 1-3 years of experience. Skills required: Knowledge of Ayurvedic medicines and formulations, pharmacy management, customer service. YOGA THERAPIST: Average Salary(LPA) Rs.5,80,000, 2-4 years of experience. Skills required: Yoga teaching skills, understanding of Ayurvedic principles, patient management, empathy, communication skills. These figures are approximate and may vary based on location and individual factors."
      ]
    },
    {
      "tag": "bhms_jobs",
      "patterns": [
        "Job opportunities after completing BHMS",
        "Career options with BHMS degree",
        "Jobs after BHMS",
        "bhms jobs",
        "Bachelor of Homeopathic Medicine and Surgery jobs",
        "homeopathic course jobs",
        "homeopathy"
      ],
      "responses": [
        "After completing BHMS, you can explore various job opportunities: HOMEOPATHIC DOCTOR: Average Salary(LPA) Rs.5,50,000, 2-4 years of experience. Skills required: Medical knowledge, diagnostic skills, knowledge of homeopathic principles and treatments, empathy, communication skills. HOMEOPATHIC CONSULTANT: Average Salary(LPA) Rs.5,00,000, 1-3 years of experience. Skills required: Consultation skills, homeopathic treatment planning, patient education, communication skills. RESEARCHER IN HOMEOPATHY: Average Salary(LPA) Rs.6,00,000, 2-4 years of experience. Skills required: Research skills, knowledge of homeopathic research methodologies, data analysis, scientific writing. HOMEOPATHIC PHARMACIST: Average Salary(LPA) Rs.4,50,000, 1-3 years of experience. Skills required: Knowledge of homeopathic medicines and formulations, pharmacy management, customer service. LECTURER IN HOMEOPATHY COLLEGE: Average Salary(LPA) Rs.5,80,000, 2-4 years of experience. Skills required: Teaching skills, knowledge of homeopathic principles, curriculum development, student assessment, communication skills. These figures are approximate and may vary based on location and individual factors."
      ]
    },
    {
      "tag": "bpt_jobs",
      "patterns": [
        "Job opportunities after completing BPT",
        "Career options with BPT degree",
        "Jobs after BPT",
        "bpt jobs",
        "bachelor of physiotherapy jobs",
        "physiotherapy jobs"
      ],
      "responses": [
        "After completing BPT, you can explore various job opportunities: PHYSIOTHERAPIST: Average Salary(LPA) Rs.4,50,000, 1-3 years of experience. Skills required: Rehabilitation techniques, patient assessment, treatment planning, manual therapy, communication skills. REHABILITATION SPECIALIST: Average Salary(LPA) Rs.5,00,000, 1-3 years of experience. Skills required: Rehabilitation program development, patient education, adaptive equipment prescription, interdisciplinary teamwork. FITNESS CONSULTANT: Average Salary(LPA) Rs.4,20,000, 1-3 years of experience. Skills required: Fitness assessment, exercise prescription, motivation skills, client management, knowledge of anatomy and physiology. SPORTS PHYSIOTHERAPIST: Average Salary(LPA) Rs.4,80,000, 1-3 years of experience. Skills required: Sports injury assessment and management, exercise rehabilitation, sports performance enhancement, communication skills. CLINICAL PHYSIOTHERAPIST: Average Salary(LPA) Rs.5,50,000, 2-4 years of experience. Skills required: Advanced manual therapy techniques, specialization in specific clinical areas, interdisciplinary collaboration, leadership skills. These figures are approximate and may vary based on location and individual factors."
      ]
    },
    {
      "tag": "bcom_jobs",
      "patterns": [
        "Job opportunities after completing B.Com",
        "Career options with B.Com degree",
        "Jobs after B.Com",
        "bcom jobs",
        "bachelor of commerce jobs"
      ],
      "responses": [
        "After completing B.Com, you can explore various job opportunities: ACCOUNTANT: Average Salary(LPA) Rs.5,50,000, 1-3 years of experience. Skills required: Financial accounting, taxation knowledge, proficiency in accounting software, attention to detail. FINANCIAL ANALYST: Average Salary(LPA) Rs.6,00,000, 2-4 years of experience. Skills required: Financial analysis, investment analysis, financial modeling, analytical skills, knowledge of financial markets. AUDITOR: Average Salary(LPA) Rs.5,80,000, 1-3 years of experience. Skills required: Audit procedures, accounting standards, attention to detail, analytical skills, communication skills. TAX CONSULTANT: Average Salary(LPA) Rs.6,20,000, 2-4 years of experience. Skills required: Tax planning, compliance, tax regulations knowledge, analytical skills, communication skills. BUSINESS ANALYST: Average Salary(LPA) Rs.6,50,000, 2-4 years of experience. Skills required: Business analysis, requirement gathering, data analysis, problem-solving, communication skills. These figures are approximate and may vary based on location and individual factors."
      ]
    },
    {
      "tag": "bba_jobs",
      "patterns": [
        "Job opportunities after completing BBA",
        "Career options with BBA degree",
        "Jobs after BBA",
        "bba jobs",
        "bachelor of business administration jobs"
      ],
      "responses": [
        "After completing BBA, you can explore various job opportunities: MARKETING MANAGER: Average Salary(LPA) Rs.6,50,000, 2-4 years of experience. Skills required: Marketing strategy development, market research, branding, communication skills, leadership abilities. FINANCIAL ANALYST: Average Salary(LPA) Rs.6,00,000, 2-4 years of experience. Skills required: Financial analysis, investment analysis, financial modeling, analytical skills, knowledge of financial markets. HR MANAGER: Average Salary(LPA) Rs.6,20,000, 2-4 years of experience. Skills required: Human resource management, recruitment, employee relations, conflict resolution, organizational skills. OPERATIONS MANAGER: Average Salary(LPA) Rs.6,80,000, 3-5 years of experience. Skills required: Operations management, process optimization, supply chain management, leadership abilities, problem-solving skills. BUSINESS DEVELOPMENT EXECUTIVE: Average Salary(LPA) Rs.5,50,000, 1-3 years of experience. Skills required: Business development, sales, client relationship management, negotiation skills, communication skills. These figures are approximate and may vary based on location and individual factors."
      ]
    },
    
    {
      "tag": "ca_jobs",
      "patterns": [
        "Job opportunities after completing CA",
        "Career options with CA degree",
        "Jobs after CA",
        "chartered accountancy jobs",
        "ca jobs",
        "chartered accountant"
      ],
      "responses": [
        "After completing CA, you can explore various job opportunities: CHARTERED ACCOUNTANT: Average Salary(LPA) Rs.8,00,000, 3-6 years of experience. Skills required: Financial accounting, auditing, taxation, financial analysis, regulatory compliance. TAX CONSULTANT: Average Salary(LPA) Rs.7,50,000, 2-4 years of experience. Skills required: Tax planning, tax compliance, knowledge of tax laws and regulations, communication skills, analytical abilities. AUDITOR: Average Salary(LPA) Rs.7,80,000, 3-5 years of experience. Skills required: Audit planning, risk assessment, audit procedures, attention to detail, analytical skills. FINANCIAL ANALYST: Average Salary(LPA) Rs.8,50,000, 4-7 years of experience. Skills required: Financial analysis, investment analysis, financial modeling, data interpretation, critical thinking. CONSULTING: Average Salary(LPA) Rs.9,00,000, 4-6 years of experience. Skills required: Problem-solving, strategic thinking, client management, communication skills, industry knowledge. These figures are approximate and may vary based on location and individual factors."
      ]
    },
    
    {
      "tag": "bba_jobs",
      "patterns": [
        "Job opportunities after completing BBA",
        "Career options with BBA degree",
        "Jobs after BBA",
        "bba jobs",
        "bba",
        "bachelor of business administration"
      ],
      "responses": [
        "After completing BBA, you can explore various job opportunities: BUSINESS ANALYST: Average Salary(LPA) Rs.7,50,000, 2-5 years of experience. Required skills: Data analysis, market research, problem-solving, communication skills. MARKETING EXECUTIVE: Average Salary(LPA) Rs.7,00,000, 2-4 years of experience. Required skills: Marketing strategies, customer relationship management, creativity, negotiation skills. HUMAN RESOURCE MANAGER: Average Salary(LPA) Rs.8,00,000, 3-5 years of experience. Required skills: Recruitment, employee relations, performance management, HR policies, leadership abilities. FINANCIAL ADVISOR: Average Salary(LPA) Rs.7,80,000, 2-4 years of experience. Required skills: Financial planning, investment analysis, risk management, interpersonal skills. ENTREPRENEUR: Potential earnings vary. Required skills: Business acumen, risk-taking ability, innovation, leadership, decision-making skills. These figures are approximate and may vary based on location and individual factors."
      ]
    },
    {
      "tag": "cs_jobs",
      "patterns": [
        "Career options with Company secretary degree",
        "Jobs after Company secretary",
        "company secretary jobs"
      ],
      "responses": [
        "Career options after completing Company Secretary degree: COMPANY SECRETARY: Average Salary(LPA) Rs.7,00,000, 2-5 years of experience. Required skills: Legal compliance, corporate governance, company law, regulatory affairs, communication skills. LEGAL ADVISOR: Average Salary(LPA) Rs.6,50,000, 1-3 years of experience. Required skills: Legal research, contract drafting, negotiation skills, attention to detail. CORPORATE CONSULTANT: Average Salary(LPA) Rs.6,80,000, 2-4 years of experience. Required skills: Business advisory, financial analysis, strategic planning, client management. COMPLIANCE OFFICER: Average Salary(LPA) Rs.7,20,000, 3-5 years of experience. Required skills: Regulatory compliance, risk management, audit coordination, problem-solving. EXECUTIVE ASSISTANT: Average Salary(LPA) Rs.6,00,000, 1-3 years of experience. Required skills: Administrative support, organizational skills, time management, multitasking. These figures are approximate and may vary based on location and individual factors."
      ]
    },
    {
      "tag": "cma_jobs",
      "patterns": [
        "Job opportunities after completing CMA",
        "Career options with CMA degree",
        "Jobs after CMA",
        "cma jobs",
        "cost and management accountancy"
      ],
      "responses": [
        "Job opportunities after completing Cost and Management Accountancy (CMA) include: COST ACCOUNTANT: Average Salary(LPA) Rs.6,50,000, 2-4 years of experience. Required skills: Cost accounting, financial analysis, cost management, budgeting, attention to detail. MANAGEMENT ACCOUNTANT: Average Salary(LPA) Rs.6,80,000, 2-4 years of experience. Required skills: Management accounting, financial reporting, variance analysis, decision support, strategic planning. FINANCIAL ANALYST: Average Salary(LPA) Rs.7,00,000, 2-4 years of experience. Required skills: Financial analysis, forecasting, investment analysis, data interpretation, communication skills. BUDGET ANALYST: Average Salary(LPA) Rs.6,20,000, 1-3 years of experience. Required skills: Budget planning, financial modeling, variance analysis, Excel proficiency, problem-solving. TREASURY ANALYST: Average Salary(LPA) Rs.7,20,000, 3-5 years of experience. Required skills: Treasury management, cash flow forecasting, risk management, financial instruments, analytical skills. These figures are approximate and may vary based on location and individual factors."
      ]
    },
    {
      "tag": "ba_jobs",
      "patterns": [
        "Job opportunities after completing BA",
        "Career options with B.A degree",
        "Jobs after BA",
        "bachelor of arts jobs",
        "ba jobs"
      ],
      "responses": [
        "Job opportunities after completing Bachelor of Arts (BA) include: CONTENT WRITER: Average Salary(LPA) Rs.4,00,000, 1-3 years of experience. Required skills: Writing proficiency, creativity, research skills, attention to detail, time management. EVENT PLANNER: Average Salary(LPA) Rs.4,50,000, 1-3 years of experience. Required skills: Event management, organization, communication, negotiation, budgeting. GRAPHIC DESIGNER: Average Salary(LPA) Rs.4,20,000, 1-3 years of experience. Required skills: Graphic design software proficiency, creativity, visual communication, attention to detail. SOCIAL MEDIA MANAGER: Average Salary(LPA) Rs.3,80,000, 0-2 years of experience. Required skills: Social media management, content creation, analytics, community engagement, communication. PUBLIC RELATIONS SPECIALIST: Average Salary(LPA) Rs.4,00,000, 1-3 years of experience. Required skills: Public relations, communication, media relations, crisis management, interpersonal skills. These figures are approximate and may vary based on location and individual factors."
      ]
    },
    {
      "tag": "bsc_jobs",
      "patterns": [
        "Job opportunities after completing B.Sc",
        "Career options with B.Sc degree",
        "Jobs after B.Sc",
        "bsc jobs",
        "bachelor of science jobs"
      ],
      "responses": [
        "Job opportunities after completing Bachelor of Science (B.Sc) include: RESEARCH SCIENTIST: Average Salary(LPA) Rs.7,00,000, 2-5 years of experience. Required skills: Research methodology, data analysis, critical thinking, attention to detail, scientific writing. DATA ANALYST: Average Salary(LPA) Rs.6,50,000, 2-4 years of experience. Required skills: Data analysis, statistical analysis, programming, data visualization, problem-solving. STATISTICIAN: Average Salary(LPA) Rs.6,80,000, 2-4 years of experience. Required skills: Statistical analysis, mathematical modeling, critical thinking, attention to detail, communication. PHYSICS TEACHER: Average Salary(LPA) Rs.5,50,000, 1-3 years of experience. Required skills: Teaching, subject knowledge, communication, classroom management, creativity. LAB TECHNICIAN: Average Salary(LPA) Rs.5,00,000, 1-3 years of experience. Required skills: Laboratory techniques, equipment operation, data collection, attention to detail, safety protocols. These figures are approximate and may vary based on location and individual factors."
      ]
    },
    {
      "tag": "bca_jobs",
      "patterns": [
        "Job opportunities after completing BCA",
        "Career options with BCA degree",
        "Jobs after BCA",
        "bachelor of computer applications jobs",
        "bachelor of computer application jobs",
        "bca jobs"
      ],
      "responses": [
        "Job opportunities after completing Bachelor of Computer Applications (BCA) include: SOFTWARE DEVELOPER: Average Salary(LPA) Rs.6,50,000, 2-4 years of experience. Required skills: Programming languages (such as Java, C++, or Python), software development methodologies, problem-solving, teamwork. SYSTEM ANALYST: Average Salary(LPA) Rs.7,00,000, 3-5 years of experience. Required skills: System analysis, requirement gathering, software design, communication, critical thinking. NETWORK ADMINISTRATOR: Average Salary(LPA) Rs.6,80,000, 2-4 years of experience. Required skills: Network administration, network security, troubleshooting, communication, attention to detail. DATABASE ADMINISTRATOR: Average Salary(LPA) Rs.7,20,000, 3-5 years of experience. Required skills: Database management systems (such as MySQL, Oracle), data modeling, SQL, problem-solving, attention to detail. WEB DEVELOPER: Average Salary(LPA) Rs.7,50,000, 3-6 years of experience. Required skills: Web development technologies (such as HTML, CSS, JavaScript), web frameworks (such as React, Angular), creativity, problem-solving, attention to detail. These figures are approximate and may vary based on location and individual factors."
      ]
    },
    {
      "tag": "barch_jobs",
      "patterns": [
        "Job opportunities after completing B.Arch",
        "Career options with B.Arch degree",
        "Jobs after B.Arch",
        "barch jobs",
        "bachelor of architecture jobs"
      ],
      "responses": [
        "Job opportunities after completing Bachelor of Architecture (B.Arch) include: ARCHITECT: Average Salary(LPA) Rs.8,00,000, 3-6 years of experience. Required skills: Architectural design, drafting, building codes and regulations, project management, communication. URBAN PLANNER: Average Salary(LPA) Rs.7,50,000, 2-4 years of experience. Required skills: Urban planning principles, land use regulations, GIS software, research skills, communication. INTERIOR DESIGNER: Average Salary(LPA) Rs.7,00,000, 2-4 years of experience. Required skills: Interior design principles, space planning, material selection, visualization skills, creativity. LANDSCAPE ARCHITECT: Average Salary(LPA) Rs.7,80,000, 3-6 years of experience. Required skills: Landscape design, environmental sustainability, plant knowledge, project management, teamwork. PROJECT MANAGER: Average Salary(LPA) Rs.8,50,000, 4-7 years of experience. Required skills: Project management, budgeting, scheduling, team leadership, problem-solving. These figures are approximate and may vary based on location and individual factors."
      ]
    },
    {
      "tag": "bdesign_jobs",
      "patterns": [
        "Job opportunities after completing B.Design",
        "Career options with B.Design degree",
        "Jobs after B.Design",
        "bdesign jobs",
        "bachelor of design jobs"
      ],
      "responses": [
        "Job opportunities after completing Bachelor of Design (B.Design) include: FASHION DESIGNER: Average Salary(LPA) Rs.6,00,000, 2-4 years of experience. Required skills: Fashion design, garment construction, trend analysis, creativity, communication. GRAPHIC DESIGNER: Average Salary(LPA) Rs.5,50,000, 1-3 years of experience. Required skills: Graphic design software proficiency, typography, layout design, creativity, attention to detail. UX/UI DESIGNER: Average Salary(LPA) Rs.6,50,000, 2-4 years of experience. Required skills: User experience design, user interface design, wireframing, prototyping, problem-solving. INDUSTRIAL DESIGNER: Average Salary(LPA) Rs.7,00,000, 3-5 years of experience. Required skills: Product design, CAD software proficiency, prototyping, materials knowledge, innovation. CREATIVE DIRECTOR: Average Salary(LPA) Rs.8,00,000, 4-7 years of experience. Required skills: Leadership, creative direction, project management, communication, strategic thinking. These figures are approximate and may vary based on location and individual factors."
      ]
    },
    {
      "tag": "law_jobs",
      "patterns": [
        "Job opportunities after completing Law",
        "Career options with Law degree",
        "Jobs after Law",
        "law jobs",
        "llb jobs"
      ],
      "responses": [
        "Job opportunities after completing a Law degree (LLB) include: LAWYER: Average Salary(LPA) Rs.6,00,000, 2-4 years of experience. Required skills: Legal research, litigation, negotiation, communication, advocacy. LEGAL CONSULTANT: Average Salary(LPA) Rs.7,00,000, 3-5 years of experience. Required skills: Legal advisory, contract drafting, client management, problem-solving, analytical skills. JUDICIAL CLERK: Average Salary(LPA) Rs.5,50,000, 1-3 years of experience. Required skills: Legal research, document review, court procedure knowledge, attention to detail, organizational skills. CORPORATE COUNSEL: Average Salary(LPA) Rs.7,50,000, 3-6 years of experience. Required skills: Corporate law expertise, regulatory compliance, contract negotiation, risk management, business acumen. LEGAL RESEARCHER: Average Salary(LPA) Rs.6,50,000, 2-4 years of experience. Required skills: Legal research methodologies, critical thinking, attention to detail, writing skills, analytical skills. These figures are approximate and may vary based on location and individual factors."
      ]
    },
    {
      "tag": "integrated_law_jobs",
      "patterns": [
        "Job opportunities after completing integrated law programs",
        "Career options with integrated law degrees",
        "Jobs after B.A. LLB, B.Com LLB, BBA LLB",
        "B.A llb",
        "ba llb",
        "b.com LLB",
        "b.com llb",
        "bba llb"
      ],
      "responses": [
        "Job opportunities after completing integrated law programs (B.A. LLB, B.Com LLB, BBA LLB) include: LAWYER: Average Salary(LPA) Rs.7,00,000, 2-5 years of experience. Required skills: Legal research, litigation, negotiation, communication, advocacy. LEGAL ADVISOR: Average Salary(LPA) Rs.7,50,000, 3-7 years of experience. Required skills: Legal advisory, client counseling, contract drafting, analytical skills, problem-solving. CORPORATE COUNSEL: Average Salary(LPA) Rs.8,00,000, 3-6 years of experience. Required skills: Corporate law expertise, regulatory compliance, contract negotiation, risk management, business acumen. JUDICIAL SERVICES: Average Salary(LPA) Rs.7,80,000, 2-5 years of experience. Required skills: Knowledge of legal procedures, case management, research skills, decision-making. LEGAL RESEARCHER: Average Salary(LPA) Rs.6,80,000, 2-4 years of experience. Required skills: Legal research methodologies, critical thinking, attention to detail, writing skills, analytical skills. These figures are approximate and may vary based on location and individual factors."
      ]
    },
    {
      "tag": "bhm_jobs",
      "patterns": [
        "Job opportunities after completing BHM",
        "Career options with BHM degree",
        "Jobs after BHM",
        "hotel management jobs"
      ],
      "responses": [
        "Job opportunities after completing BHM (Bachelor of Hotel Management) include: HOTEL MANAGER: Average Salary(LPA) Rs.7,50,000, 3-5 years of experience. Required skills: Hospitality management, leadership, customer service, operations management, problem-solving. EVENT MANAGER: Average Salary(LPA) Rs.7,00,000, 2-4 years of experience. Required skills: Event planning, coordination, budget management, vendor management, communication. FRONT OFFICE MANAGER: Average Salary(LPA) Rs.6,80,000, 2-4 years of experience. Required skills: Front office operations, guest relations, staff supervision, problem resolution, organizational skills. FOOD AND BEVERAGE MANAGER: Average Salary(LPA) Rs.7,20,000, 3-5 years of experience. Required skills: Food and beverage management, menu planning, inventory control, sanitation standards, leadership. EXECUTIVE CHEF: Average Salary(LPA) Rs.8,00,000, 4-7 years of experience. Required skills: Culinary expertise, kitchen management, menu development, staff training, creativity. These figures are approximate and may vary based on location and individual factors."
      ]
    },

    {
      "tag": "fashion_design_jobs",
      "patterns": [
        "Job opportunities after completing Fashion Design",
        "Career options with Fashion Design degree",
        "Jobs after Fashion Design",
        "bf tech jobs",
        "bdes jobs",
        "bachelor of fashion technology jobs",
        "fashion technology"
      ],
      "responses": [
        "Job opportunities after completing Fashion Design or Fashion Technology programs include: FASHION DESIGNER: Average Salary(LPA) Rs.6,00,000, 2-4 years of experience. Required skills: Fashion design, creativity, trend analysis, garment construction, knowledge of fabrics. FASHION MERCHANDISER: Average Salary(LPA) Rs.5,50,000, 1-3 years of experience. Required skills: Merchandising, market analysis, inventory management, product development, negotiation. TEXTILE DESIGNER: Average Salary(LPA) Rs.5,80,000, 2-4 years of experience. Required skills: Textile design, pattern making, CAD software proficiency, color theory, attention to detail. STYLIST: Average Salary(LPA) Rs.5,20,000, 1-3 years of experience. Required skills: Fashion styling, trend forecasting, communication, creativity, attention to detail. RETAIL BUYER: Average Salary(LPA) Rs.6,50,000, 2-4 years of experience. Required skills: Retail buying, vendor management, negotiation, product selection, market analysis. These figures are approximate and may vary based on location and individual factors."
      ]
    },
{
  "tag": "bfa_jobs",
  "patterns": [
    "Job opportunities after completing BFA",
    "Career options with BFA degree",
    "Jobs after BFA",
    "bachelor of fine arts jobs",
    "bfa jobs"
  ],
  "responses": [
    "Job opportunities after completing a Bachelor of Fine Arts (BFA) degree include: GRAPHIC DESIGNER: Average Salary(LPA) Rs.4,00,000, 1-3 years of experience. Required skills: Graphic design software proficiency, creativity, typography, visual communication, attention to detail. VISUAL ARTIST: Average Salary(LPA) Rs.3,50,000, 0-2 years of experience. Required skills: Artistic talent, creativity, visual expression, mastery of various art mediums, portfolio development. CREATIVE DIRECTOR: Average Salary(LPA) Rs.5,50,000, 3-5 years of experience. Required skills: Creative leadership, strategic thinking, team management, visual storytelling, project management. ILLUSTRATOR: Average Salary(LPA) Rs.3,80,000, 1-3 years of experience. Required skills: Illustration techniques, creativity, storytelling, digital illustration tools, collaboration. ART TEACHER: Average Salary(LPA) Rs.3,00,000, 0-2 years of experience. Required skills: Teaching ability, subject expertise, classroom management, lesson planning, student engagement. These figures are approximate and may vary based on location and individual factors."
  ]
},

{
  "tag": "bsc_nursing_jobs",
  "patterns": [
    "Job opportunities after completing B.Sc. Nursing",
    "Career options with B.Sc Nursing degree",
    "Jobs after B.Sc. Nursing",
    "BSc Nursing"
  ],
  "responses": [
    "After completing a B.Sc. Nursing degree, you can explore various job opportunities in the healthcare sector, including: REGISTERED NURSE: Average Salary(LPA) Rs.4,50,000, 1-3 years of experience. Skills required: Patient care, medical knowledge, critical thinking, compassion, communication. NURSE PRACTITIONER: Average Salary(LPA) Rs.5,00,000, 2-4 years of experience. Skills required: Advanced nursing practice, diagnostic skills, patient assessment, healthcare counseling, collaboration. NURSING SUPERVISOR: Average Salary(LPA) Rs.5,50,000, 3-5 years of experience. Skills required: Leadership, staff management, organizational skills, healthcare administration, problem-solving. ICU NURSE: Average Salary(LPA) Rs.4,80,000, 1-3 years of experience. Skills required: Critical care nursing, monitoring patients, life-saving interventions, teamwork, emergency response. PEDIATRIC NURSE: Average Salary(LPA) Rs.5,00,000, 2-4 years of experience. Skills required: Pediatric care, child development knowledge, family support, pediatric nursing procedures, empathy. These figures are approximate and may vary based on location and individual factors."
  ]
},

{
  "tag": "bsc_cs_jobs",
  "patterns": [
    "Job opportunities after completing B.Sc Computer Science",
    "Career options with B.Sc. CS degree",
    "Jobs after B.Sc. Computer Science",
    "bsc computer science jobs",
    "bsc cs jobs",
    "b.sc cs",
    "b.sc computer science"
  ],
  "responses": [
    "After completing a B.Sc. Computer Science degree, you can explore various job opportunities in the IT industry, including: SOFTWARE ENGINEER: Average Salary(LPA) Rs.7,50,000, 2-5 years of experience. Skills required: Proficiency in programming languages like Java, Python, or C++, understanding of software development methodologies, problem-solving abilities, teamwork skills. DATA SCIENTIST: Average Salary(LPA) Rs.8,50,000, 3-6 years of experience. Skills required: Data analysis skills, proficiency in statistical analysis tools like Python or R, knowledge of machine learning algorithms, data visualization skills. CYBERSECURITY ANALYST: Average Salary(LPA) Rs.8,00,000, 3-5 years of experience. Skills required: Knowledge of cybersecurity principles, familiarity with security tools and technologies, understanding of network protocols, analytical skills. WEB DEVELOPER: Average Salary(LPA) Rs.7,00,000, 2-4 years of experience. Skills required: Proficiency in web development technologies like HTML, CSS, JavaScript, knowledge of web frameworks like React or Angular, creativity in design and problem-solving. IT PROJECT MANAGER: Average Salary(LPA) Rs.9,00,000, 4-7 years of experience. Skills required: Project management skills, leadership abilities, communication skills, risk management expertise, knowledge of software development lifecycle. These figures are approximate and may vary based on location and individual factors."
  ]
},

{
  "tag": "bsc_it_jobs",
  "patterns": [
    "Job opportunities after completing B.Sc. IT",
    "Career options with B.Sc. IT degree",
    "Jobs after B.Sc IT",
    "BSc IT jobs",
    "b.sc it",
    "bsc information technology jobs"
  ],
  "responses": [
    "After completing a B.Sc. Information Technology (IT) degree, you can explore various job opportunities in the IT industry, including: IT SUPPORT SPECIALIST: Average Salary(LPA) Rs.6,50,000, 2-4 years of experience. Skills required: Troubleshooting skills, knowledge of operating systems and networking fundamentals, customer service skills, communication skills. NETWORK ADMINISTRATOR: Average Salary(LPA) Rs.7,00,000, 3-5 years of experience. Skills required: Knowledge of network protocols and configurations, experience with network hardware and software, problem-solving abilities, attention to detail. WEB DEVELOPER: Average Salary(LPA) Rs.6,80,000, 2-4 years of experience. Skills required: Proficiency in web development technologies like HTML, CSS, JavaScript, knowledge of web frameworks like React or Angular, creativity in design and problem-solving. DATABASE ANALYST: Average Salary(LPA) Rs.7,20,000, 3-5 years of experience. Skills required: Database management skills, proficiency in SQL, understanding of database design principles, analytical skills. SYSTEMS ANALYST: Average Salary(LPA) Rs.7,50,000, 3-6 years of experience. Skills required: Analytical skills, problem-solving abilities, understanding of business processes, knowledge of IT systems and technologies, communication skills. These figures are approximate and may vary based on location and individual factors."
  ]
},

{
  "tag": "bsc_physics_jobs",
  "patterns": [
    "Job opportunities after completing B.Sc. Physics",
    "Career options with B.Sc. Physics degree",
    "Jobs after B.Sc Physics",
    "BSc Physics jobs"
  ],
  "responses": [
    "After completing a B.Sc. Physics degree, you can explore various job opportunities in fields such as research, data analysis, education, and laboratory work, including: RESEARCH SCIENTIST: Average Salary(LPA) Rs.7,00,000, 2-5 years of experience. Skills required: Research skills, data analysis abilities, critical thinking, attention to detail. DATA ANALYST: Average Salary(LPA) Rs.6,50,000, 2-4 years of experience. Skills required: Data analysis skills, proficiency in statistical software like R or Python, problem-solving abilities. STATISTICIAN: Average Salary(LPA) Rs.6,80,000, 2-4 years of experience. Skills required: Statistical analysis skills, proficiency in statistical software, mathematical abilities. PHYSICS TEACHER: Average Salary(LPA) Rs.5,00,000, 1-3 years of experience. Skills required: Teaching abilities, communication skills, subject matter expertise in physics. LAB TECHNICIAN: Average Salary(LPA) Rs.5,00,000, 1-3 years of experience. Skills required: Laboratory skills, attention to detail, knowledge of experimental procedures. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "bsc_chemistry_jobs",
  "patterns": [
    "Job opportunities after completing B.Sc. Chemistry",
    "Career options with B.Sc. Chemistry degree",
    "Jobs after B.Sc Chemistry",
    "BSc Chemistry jobs"
  ],
  "responses": [
    "After completing a B.Sc. Chemistry degree, you can explore various job opportunities in fields such as research, pharmaceuticals, quality control, and laboratory work, including: CHEMIST: Average Salary(LPA) Rs.6,00,000, 2-4 years of experience. Skills required: Knowledge of chemical principles, laboratory skills, analytical abilities. PHARMACEUTICAL RESEARCHER: Average Salary(LPA) Rs.6,50,000, 2-4 years of experience. Skills required: Research skills, knowledge of pharmaceutical processes, attention to detail. CHEMICAL ANALYST: Average Salary(LPA) Rs.5,80,000, 2-4 years of experience. Skills required: Analytical skills, proficiency in laboratory techniques, attention to detail. QUALITY CONTROL OFFICER: Average Salary(LPA) Rs.5,50,000, 1-3 years of experience. Skills required: Quality management skills, attention to detail, knowledge of regulatory standards. LAB TECHNICIAN: Average Salary(LPA) Rs.5,00,000, 1-3 years of experience. Skills required: Laboratory skills, attention to detail, knowledge of experimental procedures. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "bsc_mathematics_jobs",
  "patterns": [
    "Job opportunities after completing B.Sc. Mathematics",
    "Career options with B.Sc. Mathematics degree",
    "Jobs after B.Sc Mathematics",
    "BSc Mathematics jobs",
    "bsc maths jobs"
  ],
  "responses": [
    "After completing a B.Sc. Mathematics degree, you can explore various job opportunities in fields such as finance, data analysis, statistics, and operations research, including: ACTUARY: Average Salary(LPA) Rs.8,00,000, 3-6 years of experience. Skills required: Mathematical modeling, risk assessment, analytical abilities. DATA ANALYST: Average Salary(LPA) Rs.7,00,000, 2-4 years of experience. Skills required: Data analysis, statistical programming, critical thinking. STATISTICIAN: Average Salary(LPA) Rs.7,50,000, 3-5 years of experience. Skills required: Statistical analysis, data interpretation, mathematical modeling. FINANCIAL ANALYST: Average Salary(LPA) Rs.8,50,000, 4-7 years of experience. Skills required: Financial modeling, investment analysis, quantitative skills. OPERATIONS RESEARCH ANALYST: Average Salary(LPA) Rs.7,80,000, 3-6 years of experience. Skills required: Optimization techniques, problem-solving skills, analytical abilities. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "after_10th_jobs",
  "patterns": [
    "Job opportunities after completing 10th grade",
    "Career options after 10th",
    "Jobs after 10th",
    "after 10 standard jobs",
    "10 standard jobs"
  ],
  "responses": [
    "After completing 10th grade, there are various job opportunities available for individuals who may not pursue further education immediately. Some options include: SALES ASSOCIATE: Average Salary(LPA) Rs.2,50,000, 0-2 years of experience. Skills required: Communication skills, basic arithmetic, customer service abilities. RETAIL ASSISTANT: Average Salary(LPA) Rs.2,20,000, 0-1 year of experience. Skills required: Customer service, inventory management, basic computer skills. DATA ENTRY OPERATOR: Average Salary(LPA) Rs.2,00,000, 0-1 year of experience. Skills required: Typing speed, attention to detail, basic computer skills. CUSTOMER SERVICE REPRESENTATIVE: Average Salary(LPA) Rs.2,30,000, 0-1 year of experience. Skills required: Communication skills, problem-solving abilities, patience. DELIVERY PERSON: Average Salary(LPA) Rs.1,80,000, 0-1 year of experience. Skills required: Driving skills, time management, familiarity with local areas. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "after_12th_pcm_jobs",
  "patterns": [
    "Job opportunities after completing 12th Science (PCM)",
    "Career options after 12th PCM",
    "Jobs after 12th Science (PCM)",
    "pcm jobs",
    "12 science jobs"
  ],
  "responses": [
    "After completing 12th Science with Physics, Chemistry, and Mathematics (PCM), there are various job opportunities available in different fields. Some options include: ENGINEER: Average Salary(LPA) Rs.7,00,000, 2-5 years of experience. Skills required: Analytical skills, problem-solving abilities, proficiency in engineering concepts. DATA ANALYST: Average Salary(LPA) Rs.6,50,000, 2-4 years of experience. Skills required: Data analysis skills, statistical knowledge, proficiency in data visualization tools. STATISTICIAN: Average Salary(LPA) Rs.6,80,000, 2-4 years of experience. Skills required: Statistical analysis, mathematical modeling, critical thinking. PHYSICS TEACHER: Average Salary(LPA) Rs.5,50,000, 1-3 years of experience. Skills required: Teaching abilities, knowledge of physics concepts, communication skills. LAB TECHNICIAN: Average Salary(LPA) Rs.5,00,000, 1-3 years of experience. Skills required: Laboratory techniques, attention to detail, analytical skills. These figures are approximate and may vary based on location and individual factors."
  ]
},

{
  "tag": "after_12th_commerce_jobs",
  "patterns": [
    "Job opportunities after completing 12th Commerce",
    "Career options after 12th Commerce",
    "Jobs after 12th Commerce",
    "12 commerce jobs",
    "12 commerce group jobs"
  ],
  "responses": [
    "After completing 12th Commerce, there are various job opportunities available in different fields. Some options include: ACCOUNTANT: Average Salary(LPA) Rs.5,00,000, 1-3 years of experience. Skills required: Knowledge of accounting principles, proficiency in accounting software, attention to detail. FINANCIAL ANALYST: Average Salary(LPA) Rs.5,50,000, 2-4 years of experience. Skills required: Financial analysis, data interpretation, financial modeling. MARKETING EXECUTIVE: Average Salary(LPA) Rs.4,80,000, 1-3 years of experience. Skills required: Marketing strategies, communication skills, market research. HUMAN RESOURCE ASSISTANT: Average Salary(LPA) Rs.4,50,000, 0-2 years of experience. Skills required: HR policies, recruitment processes, interpersonal skills. CUSTOMER SERVICE REPRESENTATIVE: Average Salary(LPA) Rs.4,20,000, 0-2 years of experience. Skills required: Customer service, communication skills, problem-solving abilities. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "after_12th_arts_jobs",
  "patterns": [
    "Job opportunities after completing 12th Arts",
    "Career options after 12th Arts",
    "Jobs after 12th Arts",
    "12 Arts jobs",
    "12 arts group jobs"
  ],
  "responses": [
    "After completing 12th Arts, there are various job opportunities available in different fields. Some options include: CONTENT WRITER: Average Salary(LPA) Rs.4,00,000, 1-3 years of experience. Skills required: Writing skills, creativity, research abilities. EVENT PLANNER: Average Salary(LPA) Rs.4,50,000, 1-3 years of experience. Skills required: Event management, organizational skills, communication abilities. GRAPHIC DESIGNER: Average Salary(LPA) Rs.4,20,000, 1-3 years of experience. Skills required: Graphic design software proficiency, creativity, attention to detail. SOCIAL MEDIA MANAGER: Average Salary(LPA) Rs.3,80,000, 0-2 years of experience. Skills required: Social media management, content creation, analytics interpretation. PUBLIC RELATIONS SPECIALIST: Average Salary(LPA) Rs.4,00,000, 1-3 years of experience. Skills required: Public relations strategies, communication skills, networking abilities. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "bsc_agriculture_jobs",
  "patterns": [
    "Job opportunities after completing B.Sc. Agriculture",
    "Career options with B.Sc Agriculture degree",
    "Jobs after B.Sc Agriculture",
    "BSc Agriculture jobs",
    "bsc agri jobs"
  ],
  "responses": [
    "After completing B.Sc. Agriculture, there are various job opportunities available in the agricultural sector. Some options include: AGRICULTURAL OFFICER: Average Salary(LPA) Rs.5,00,000, 1-3 years of experience. Skills required: Knowledge of agricultural practices, crop management, pest control. FARM MANAGER: Average Salary(LPA) Rs.4,50,000, 1-3 years of experience. Skills required: Farm management, crop planning, budgeting. AGRICULTURAL CONSULTANT: Average Salary(LPA) Rs.6,00,000, 2-4 years of experience. Skills required: Expertise in agricultural practices, problem-solving abilities, communication skills. AGRICULTURAL RESEARCH SCIENTIST: Average Salary(LPA) Rs.5,50,000, 2-4 years of experience. Skills required: Research skills, data analysis, knowledge of agricultural science. AGRICULTURAL TECHNICIAN: Average Salary(LPA) Rs.4,00,000, 0-2 years of experience. Skills required: Technical knowledge of agricultural equipment, troubleshooting abilities. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "btech_agricultural_engineering_jobs",
  "patterns": [
    "Job opportunities after completing B.Tech. Agricultural Engineering",
    "Career options with B.Tech Agricultural Engineering degree",
    "Jobs after B.Tech Agricultural Engineering",
    "BTech Agricultural Engineering jobs",
    "BTech Agri jobs",
    "b.tech agri"
  ],
  "responses": [
    "After completing B.Tech. Agricultural Engineering, you can explore various job opportunities in the agricultural and related sectors. Some career options include: AGRICULTURAL ENGINEER: Average Salary(LPA) Rs.6,00,000, 2-4 years of experience. Responsibilities may include designing agricultural machinery, developing farming systems, and implementing technology in agriculture. FARM MECHANIZATION ENGINEER: Average Salary(LPA) Rs.5,50,000, 2-4 years of experience. Tasks may involve designing and testing farm machinery and equipment to enhance productivity and efficiency. IRRIGATION ENGINEER: Average Salary(LPA) Rs.5,80,000, 2-4 years of experience. Duties may include planning and implementing irrigation systems to optimize water usage in agriculture. FOOD PROCESSING ENGINEER: Average Salary(LPA) Rs.6,20,000, 2-4 years of experience. Responsibilities may include designing and improving food processing methods and equipment to ensure food safety and quality. AGRICULTURAL CONSULTANT: Average Salary(LPA) Rs.6,00,000, 2-4 years of experience. Tasks may involve providing expert advice on agricultural practices, technology adoption, and sustainable farming methods to farmers and agricultural businesses. These figures are approximate and may vary based on location and individual factors."
  ]
},

{
  "tag": "bsc_horticulture_jobs",
  "patterns": [
    "Job opportunities after completing B.Sc. Horticulture",
    "Career options with B.Sc Horticulture degree",
    "Jobs after B.Sc. Horticulture",
    "bsc horticulture jobs",
    "bsc horti jobs"
  ],
  "responses": [
    "After completing a B.Sc. Horticulture degree, you can pursue various career options in the field of horticulture, including: HORTICULTURIST: Average Salary(LPA) Rs.5,50,000, 1-3 years of experience. Skills required: Knowledge of plant cultivation, pest management, and soil science, attention to detail. LANDSCAPE DESIGNER: Average Salary(LPA) Rs.5,00,000, 1-3 years of experience. Skills required: Design skills, knowledge of horticultural principles, creativity. NURSERY MANAGER: Average Salary(LPA) Rs.4,80,000, 1-3 years of experience. Skills required: Management skills, knowledge of plant propagation techniques, organizational abilities. PLANTATION MANAGER: Average Salary(LPA) Rs.5,20,000, 1-3 years of experience. Skills required: Management skills, knowledge of plantation operations, leadership abilities. HORTICULTURE TECHNICIAN: Average Salary(LPA) Rs.4,00,000, 0-2 years of experience. Skills required: Technical skills in horticulture, willingness to learn, attention to detail. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "bsc_forestry_jobs",
  "patterns": [
    "Job opportunities after completing B.Sc. Forestry",
    "Career options with B.Sc Forestry degree",
    "Jobs after B.Sc Forestry",
    "bsc forestry jobs"
  ],
  "responses": [
    "After completing a B.Sc. Forestry degree, you can explore various job opportunities in the field of forestry, including: FORESTER: Average Salary(LPA) Rs.5,20,000, 1-3 years of experience. Skills required: Knowledge of forest management practices, tree identification, and wildlife conservation. WILDLIFE MANAGER: Average Salary(LPA) Rs.5,50,000, 1-3 years of experience. Skills required: Understanding of wildlife ecology, conservation techniques, and habitat management. CONSERVATION OFFICER: Average Salary(LPA) Rs.5,00,000, 1-3 years of experience. Skills required: Knowledge of environmental laws and regulations, ability to develop and implement conservation plans. TIMBER BUYER: Average Salary(LPA) Rs.4,80,000, 1-3 years of experience. Skills required: Negotiation skills, knowledge of timber market trends, and forestry practices. FOREST RANGER: Average Salary(LPA) Rs.4,50,000, 1-3 years of experience. Skills required: Monitoring and enforcement skills, ability to respond to forest emergencies, knowledge of forest management techniques. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "btech_food_technology_jobs",
  "patterns": [
    "Job opportunities after completing B.Tech. Food Technology",
    "Career options with B.Tech Food Technology degree",
    "Jobs after B.Tech Food Technology",
    "btech food technology jobs"
  ],
  "responses": [
    "After completing a B.Tech. Food Technology degree, you can explore various career options in the food industry, including: FOOD TECHNOLOGIST: Average Salary(LPA) Rs.5,50,000, 2-4 years of experience. Skills required: Knowledge of food processing techniques, quality control procedures, and food safety regulations. QUALITY CONTROL ANALYST: Average Salary(LPA) Rs.5,20,000, 2-4 years of experience. Skills required: Ability to perform quality tests, analyze data, and ensure compliance with quality standards. FOOD SAFETY OFFICER: Average Salary(LPA) Rs.5,80,000, 2-4 years of experience. Skills required: Understanding of food safety regulations, ability to conduct inspections, and ensure food hygiene standards. PRODUCT DEVELOPMENT MANAGER: Average Salary(LPA) Rs.6,00,000, 3-5 years of experience. Skills required: Creativity, project management skills, and ability to innovate new food products. RESEARCH AND DEVELOPMENT SCIENTIST: Average Salary(LPA) Rs.6,20,000, 3-5 years of experience. Skills required: Research skills, scientific knowledge, and ability to develop new food technologies. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "mtech_food_technology_jobs",
  "patterns": [
    "Job opportunities after completing M.Tech in Food Technology",
    "Career options with M.Tech Food Technology degree",
    "Jobs after M.Tech Food Technology",
    "MTech Food Technology"
  ],
  "responses": [
    "After completing an M.Tech in Food Technology, you can explore various job opportunities in the food industry, including: FOOD PROCESS ENGINEER: Average Salary Rs.9,50,000 per annum, 4-7 years of experience. Skills required: Knowledge of food processing techniques, equipment design, and optimization of food production processes. QUALITY ASSURANCE MANAGER: Average Salary Rs.9,00,000 per annum, 3-6 years of experience. Skills required: Expertise in quality management systems, auditing, and compliance with food safety standards. RESEARCH AND DEVELOPMENT SCIENTIST: Average Salary Rs.8,80,000 per annum, 3-5 years of experience. Skills required: Ability to conduct research, develop new food products, and improve existing formulations. FOOD SAFETY CONSULTANT: Average Salary Rs.9,20,000 per annum, 4-6 years of experience. Skills required: In-depth knowledge of food safety regulations, risk assessment, and implementation of food safety management systems. SUPPLY CHAIN MANAGER: Average Salary Rs.10,00,000 per annum, 5-8 years of experience. Skills required: Strong organizational skills, supply chain management expertise, and ability to optimize logistics processes. These figures are approximate and may vary based on location and individual factors."
  ]
},

{
  "tag": "msc_agriculture_jobs",
  "patterns": [
    "Job opportunities after completing M.Sc. Agriculture",
    "Career options with M.Sc Agriculture degree",
    "Jobs after M.Sc Agriculture",
    "MSc Agriculture jobs",
    "MSc Agri jobs"
  ],
  "responses": [
    "After completing M.Sc. Agriculture, you can explore various career options in the field of agriculture, including: - AGRICULTURAL SCIENTIST: Average Salary(LPA) Rs.8,00,000, 3-6 years of experience. Skills required: Research skills, knowledge of agricultural practices, and ability to develop and implement innovative farming techniques. - AGRICULTURAL ECONOMIST: Average Salary(LPA) Rs.7,50,000, 3-6 years of experience. Skills required: Economic analysis, market research, and policy evaluation in the agricultural sector. - AGRICULTURAL EXTENSION OFFICER: Average Salary(LPA) Rs.7,00,000, 3-6 years of experience. Skills required: Communication skills, knowledge dissemination, and advisory services to farmers. - AGRICULTURAL CONSULTANT: Average Salary(LPA) Rs.8,50,000, 3-6 years of experience. Skills required: Expertise in agricultural practices, problem-solving abilities, and consulting skills to assist farmers and agricultural businesses. - AGRICULTURAL RESEARCHER: Average Salary(LPA) Rs.8,20,000, 3-6 years of experience. Skills required: Research methodology, data analysis, and innovation in agricultural technologies and practices. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "mtech_agricultural_engineering_jobs",
  "patterns": [
    "Job opportunities after completing M.Tech. Agricultural Engineering",
    "Career options with M.Tech. Agricultural Engineering degree",
    "Jobs after M.Tech Agricultural Engineering",
    "MTech Agricultural Engineering jobs",
    "mtech agri"
  ],
  "responses": [
    "After completing M.Tech. Agricultural Engineering, you can explore various career options in the field of agricultural engineering, including: - SENIOR AGRICULTURAL ENGINEER: Average Salary(LPA) Rs.9,00,000, 4-7 years of experience. Skills required: Design and development of agricultural machinery and equipment, project management, and leadership. - AGRICULTURAL SYSTEMS ENGINEER: Average Salary(LPA) Rs.8,50,000, 4-7 years of experience. Skills required: Optimization of agricultural systems, integration of technology into farming practices, and sustainability analysis. - RESEARCH AND DEVELOPMENT MANAGER: Average Salary(LPA) Rs.9,50,000, 5-8 years of experience. Skills required: Research leadership, innovation in agricultural technologies, and project management. - PROFESSOR/LECTURER IN AGRICULTURAL ENGINEERING: Average Salary(LPA) Rs.10,00,000, 6-9 years of experience. Skills required: Teaching, curriculum development, and research in agricultural engineering. - AGRICULTURAL CONSULTANT: Average Salary(LPA) Rs.9,20,000, 4-7 years of experience. Skills required: Expertise in agricultural engineering principles, problem-solving abilities, and consulting skills to assist farmers and agricultural businesses. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "msc_horticulture_jobs",
  "patterns": [
    "Job opportunities after completing M.Sc. Horticulture",
    "Career options with M.Sc Horticulture degree",
    "Jobs after M.Sc Horticulture",
    "MSc Horticulture jobs",
    "mtech horticulture engineering",
    "m.tech horticulture engineering"
  ],
  "responses": [
    "After completing M.Sc. Horticulture, you can explore various career options in the field of horticulture, including: - SENIOR HORTICULTURIST: Average Salary(LPA) Rs.8,50,000, 3-6 years of experience. Skills required: Expertise in horticultural practices, crop management, and leadership abilities. - HORTICULTURE MANAGER: Average Salary(LPA) Rs.8,20,000, 3-6 years of experience. Skills required: Management of horticultural operations, team coordination, and strategic planning. - RESEARCH AND DEVELOPMENT SPECIALIST: Average Salary(LPA) Rs.9,00,000, 4-7 years of experience. Skills required: Research skills, innovation in horticultural techniques, and project management. - PROFESSOR/LECTURER IN HORTICULTURE: Average Salary(LPA) Rs.9,50,000, 5-8 years of experience. Skills required: Teaching, academic research, and mentorship in horticultural science. - HORTICULTURE CONSULTANT: Average Salary(LPA) Rs.9,20,000, 4-7 years of experience. Skills required: Consulting expertise, problem-solving abilities, and knowledge of horticultural best practices. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "msc_forestry_jobs",
  "patterns": [
    "Job opportunities after completing M.Sc. Forestry",
    "Career options with M.Sc Forestry degree",
    "Jobs after M.Sc Forestry",
    "MSc Forestry jobs"
  ],
  "responses": [
    "After completing M.Sc. Forestry, you can explore various career options in the field of forestry, including: - SENIOR FORESTER: Average Salary(LPA) Rs.8,20,000, 3-6 years of experience. Skills required: Expertise in forest management, conservation practices, and leadership abilities. - FOREST MANAGER: Average Salary(LPA) Rs.8,50,000, 3-6 years of experience. Skills required: Management of forest resources, administration of forest lands, and team coordination. - RESEARCH AND DEVELOPMENT SPECIALIST: Average Salary(LPA) Rs.9,00,000, 4-7 years of experience. Skills required: Research skills, innovation in forestry techniques, and project management. - PROFESSOR/LECTURER IN FORESTRY: Average Salary(LPA) Rs.9,50,000, 5-8 years of experience. Skills required: Teaching, academic research, and mentorship in forestry science. - FORESTRY CONSULTANT: Average Salary(LPA) Rs.9,20,000, 4-7 years of experience. Skills required: Consulting expertise, problem-solving abilities, and knowledge of forestry best practices. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "phd_agriculture_jobs",
  "patterns": [
    "Job opportunities after completing Ph.D. in Agriculture",
    "Career options with Ph.D. in Agriculture",
    "Jobs after Ph.D in Agriculture",
    "phd agriculture jobs",
    "phd in agriculture jobs"
  ],
  "responses": [
    "After completing a Ph.D. in Agriculture, you can explore various rewarding career options in the field. Some of these include: - SENIOR AGRICULTURAL SCIENTIST: Average Salary(LPA) Rs.12,00,000, 7-10 years of experience. Responsibilities include leading research projects, publishing papers, and mentoring junior scientists. - PROFESSOR/LECTURER IN AGRICULTURE: Average Salary(LPA) Rs.14,00,000, 8-12 years of experience. Duties involve teaching, conducting research, and academic leadership. - RESEARCH AND DEVELOPMENT HEAD: Average Salary(LPA) Rs.15,00,000, 10+ years of experience. Tasks include overseeing research initiatives, developing strategies, and collaborating with industry partners. - AGRICULTURAL CONSULTANT: Average Salary(LPA) Rs.13,50,000, 9-12 years of experience. Responsibilities include providing expert advice to farmers, government agencies, and agricultural businesses. - CHIEF AGRICULTURAL OFFICER: Average Salary(LPA) Rs.14,50,000, 10+ years of experience. Duties involve leading agricultural programs, policy development, and ensuring compliance with regulations. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "msc_physics_jobs",
  "patterns": [
    "Job opportunities after completing M.Sc. Physics",
    "Career options with M.Sc Physics degree",
    "Jobs after M.Sc Physics",
    "MSc Physics jobs"
  ],
  "responses": [
    "After completing M.Sc. in Physics, you can explore various career options in the field. Some potential job roles include: - PHYSICIST: Average Salary(LPA) Rs.8,00,000, 4-7 years of experience. Responsibilities include conducting research, performing experiments, and analyzing data in various areas of physics. - RESEARCH SCIENTIST (PHYSICS): Average Salary(LPA) Rs.7,50,000, 3-6 years of experience. Duties involve designing and conducting experiments, analyzing data, and publishing findings in scientific journals. - DATA SCIENTIST: Average Salary(LPA) Rs.8,50,000, 4-7 years of experience. Tasks include analyzing complex data sets, developing statistical models, and deriving insights to support decision-making processes. - PROFESSOR OF PHYSICS: Average Salary(LPA) Rs.9,00,000, 5-8 years of experience. Responsibilities include teaching physics courses, conducting research, and mentoring students. - SCIENCE WRITER: Average Salary(LPA) Rs.7,00,000, 2-4 years of experience. Duties involve communicating scientific concepts and discoveries to a broader audience through writing, editing, and journalism. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "msc_chemistry_jobs",
  "patterns": [
    "Job opportunities after completing M.Sc. Chemistry",
    "Career options with M.Sc Chemistry degree",
    "Jobs after M.Sc Chemistry",
    "MSc Chemistry jobs"
  ],
  "responses": [
    "After completing M.Sc. in Chemistry, you can explore various career options in the field. Some potential job roles include: - CHEMIST: Average Salary(LPA) Rs.8,00,000, 4-7 years of experience. Responsibilities include conducting chemical analysis, research, and experiments to develop new products or processes. - RESEARCH SCIENTIST (CHEMISTRY): Average Salary(LPA) Rs.7,50,000, 3-6 years of experience. Duties involve designing and conducting experiments, analyzing data, and publishing findings in scientific journals. - LABORATORY TECHNICIAN: Average Salary(LPA) Rs.7,00,000, 2-5 years of experience. Tasks include conducting tests, maintaining laboratory equipment, and assisting with research projects. - PROFESSOR OF CHEMISTRY: Average Salary(LPA) Rs.9,00,000, 5-8 years of experience. Responsibilities include teaching chemistry courses, conducting research, and mentoring students. - PHARMACEUTICAL RESEARCHER: Average Salary(LPA) Rs.8,50,000, 4-7 years of experience. Involved in developing and testing new pharmaceutical products, analyzing data, and ensuring compliance with regulations. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "msc_mathematics_jobs",
  "patterns": [
    "Job opportunities after completing M.Sc. Mathematics",
    "Career options with M.Sc Mathematics degree",
    "Jobs after M.Sc Mathematics",
    "msc mathematics jobs"
  ],
  "responses": [
    "After completing M.Sc. in Mathematics, you can pursue various career options in diverse fields. Some potential job roles and the required skills include: - MATHEMATICIAN: Average Salary(LPA) Rs.8,50,000, 4-7 years of experience. Skills required: Advanced mathematical knowledge, problem-solving skills, critical thinking, research abilities. - STATISTICIAN: Average Salary(LPA) Rs.8,00,000, 3-6 years of experience. Skills required: Strong statistical analysis skills, data interpretation, mathematical modeling, proficiency in statistical software. - DATA ANALYST: Average Salary(LPA) Rs.7,50,000, 2-5 years of experience. Skills required: Data manipulation, statistical analysis, data visualization, programming skills (e.g., Python, R). - PROFESSOR OF MATHEMATICS: Average Salary(LPA) Rs.9,00,000, 5-8 years of experience. Skills required: Teaching abilities, research experience, communication skills, mentorship. - ACTUARY: Average Salary(LPA) Rs.9,50,000, 6-9 years of experience. Skills required: Analytical skills, risk assessment, knowledge of finance and insurance principles, proficiency in actuarial modeling software. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "bsc_botany_jobs",
  "patterns": [
    "Job opportunities after completing B.Sc. Botany",
    "Career options with B.Sc Botany degree",
    "Jobs after B.Sc. Botany",
    "BSc Botany"
  ],
  "responses": [
    "After completing B.Sc. Botany, you can explore various career opportunities. Here are some potential job roles and the required skills: - BOTANIST: Average Salary Rs.8,50,000 per annum, 3-6 years of experience. Skills required: Knowledge of plant biology, taxonomy, ecology, research skills, fieldwork experience. - PLANT GENETICIST: Average Salary Rs.8,20,000 per annum, 2-5 years of experience. Skills required: Understanding of genetics, molecular biology techniques, data analysis skills, research experience. - ENVIRONMENTAL CONSULTANT: Average Salary Rs.8,80,000 per annum, 3-6 years of experience. Skills required: Knowledge of environmental regulations, assessment techniques, problem-solving abilities, communication skills. - ECOLOGIST: Average Salary Rs.8,50,000 per annum, 3-5 years of experience. Skills required: Understanding of ecosystems, fieldwork experience, data analysis skills, report writing abilities. - HORTICULTURIST: Average Salary Rs.9,00,000 per annum, 4-7 years of experience. Skills required: Knowledge of plant cultivation, crop management, pest control, horticultural techniques, problem-solving abilities. These figures are approximate and may vary based on location and individual factors."
  ]
},

{
  "tag": "msc_botany_jobs",
  "patterns": [
    "Job opportunities after completing M.Sc. Botany",
    "Career options with M.Sc Botany degree",
    "Jobs after M.Sc Botany",
    "msc botany jobs"
  ],
  "responses": [
    "After completing M.Sc. Botany, you can pursue various career options. Here are some potential job roles, their average salaries, and the required skills: - BOTANIST: Average Salary(LPA) Rs.8,00,000, 4-7 years of experience. Skills Required: Strong knowledge of plant taxonomy, ecology, and genetics; excellent research and analytical skills. - ECOLOGIST: Average Salary(LPA) Rs.7,50,000, 3-6 years of experience. Skills Required: Understanding of ecosystems, data analysis skills, knowledge of environmental regulations. - ENVIRONMENTAL CONSULTANT: Average Salary(LPA) Rs.7,50,000, 3-6 years of experience. Skills Required: Environmental assessment expertise, project management skills, regulatory compliance knowledge. - PROFESSOR OF BOTANY: Average Salary(LPA) Rs.9,00,000, 5-8 years of experience. Skills Required: Strong teaching and communication skills, research expertise, mentorship abilities. - PLANT BIOLOGIST: Average Salary(LPA) Rs.8,50,000, 4-7 years of experience. Skills Required: Proficiency in plant biology, experimental design, data interpretation, publication writing skills. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "bsc_zoology_jobs",
  "patterns": [
    "Job opportunities after completing B.Sc. Zoology",
    "Career options with B.Sc. Zoology degree",
    "Jobs after B.Sc Zoology",
    "BSc Zoology"
  ],
  "responses": [
    "After completing B.Sc. Zoology, you can pursue various career options. Here are some potential job roles, their average salaries, and the required skills: - ZOOLOGIST: Average Salary(LPA) Rs.8,50,000, 3-6 years of experience. Skills Required: Knowledge of animal biology, behavior, and ecology; research skills, data analysis abilities. - WILDLIFE BIOLOGIST: Average Salary(LPA) Rs.8,20,000, 2-5 years of experience. Skills Required: Understanding of wildlife conservation, field research techniques, data collection and analysis. - MARINE BIOLOGIST: Average Salary(LPA) Rs.8,80,000, 3-6 years of experience. Skills Required: Knowledge of marine ecosystems, scuba diving skills (for fieldwork), research and analytical skills. - LABORATORY TECHNICIAN: Average Salary(LPA) Rs.8,50,000, 3-5 years of experience. Skills Required: Proficiency in laboratory techniques, data recording and analysis, attention to detail. - BIOLOGY TEACHER: Average Salary(LPA) Rs.9,00,000, 4-7 years of experience. Skills Required: Strong communication and teaching skills, knowledge of biology curriculum, classroom management abilities. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "bsc_biotechnology_jobs",
  "patterns": [
    "Job opportunities after completing B.Sc. Biotechnology",
    "Career options with B.Sc Biotechnology degree",
    "Jobs after B.Sc. Biotechnology",
    "BSc Biotechnology"
  ],
  "responses": [
    "After completing B.Sc. Biotechnology, you can pursue various career options. Here are some potential job roles, their average salaries, and the required skills: - BIOTECHNOLOGIST: Average Salary(LPA) Rs.9,50,000, 4-7 years of experience. Skills Required: Knowledge of biotechnological techniques, laboratory skills, research and analytical abilities. - RESEARCH SCIENTIST: Average Salary(LPA) Rs.9,00,000, 3-6 years of experience. Skills Required: Strong research skills, data analysis abilities, familiarity with laboratory techniques. - BIOINFORMATICIAN: Average Salary(LPA) Rs.8,80,000, 3-5 years of experience. Skills Required: Proficiency in bioinformatics tools and software, data analysis skills, programming knowledge. - PHARMACEUTICAL SALES REPRESENTATIVE: Average Salary(LPA) Rs.8,50,000, 2-4 years of experience. Skills Required: Excellent communication and sales skills, knowledge of pharmaceutical products, ability to build client relationships. - GENETIC ENGINEER: Average Salary(LPA) Rs.9,20,000, 4-6 years of experience. Skills Required: Understanding of genetic engineering techniques, laboratory proficiency, problem-solving abilities. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "msc_zoology_jobs",
  "patterns": [
    "Job opportunities after completing M.Sc. Zoology",
    "Career options with M.Sc Zoology degree",
    "Jobs after M.Sc Zoology",
    "msc zoology jobs"
  ],
  "responses": [
    "After completing M.Sc. Zoology, you can explore various career options. Here are some potential job roles, their average salaries, and the required skills: - ZOOLOGIST: Average Salary(LPA) Rs.8,00,000, 4-7 years of experience. Skills Required: Knowledge of animal biology, research skills, data analysis abilities. - WILDLIFE BIOLOGIST: Average Salary(LPA) Rs.7,50,000, 3-6 years of experience. Skills Required: Understanding of wildlife ecology, field research skills, knowledge of conservation techniques. - CONSERVATION BIOLOGIST: Average Salary(LPA) Rs.7,50,000, 3-6 years of experience. Skills Required: Knowledge of conservation biology principles, research skills, ability to develop conservation plans. - PROFESSOR OF ZOOLOGY: Average Salary(LPA) Rs.9,00,000, 5-8 years of experience. Skills Required: Teaching abilities, research experience, strong communication skills. - RESEARCH SCIENTIST (ZOLOGY): Average Salary(LPA) Rs.8,50,000, 4-7 years of experience. Skills Required: Strong research skills, data analysis abilities, knowledge of zoological research methods. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "msc_computer_science_jobs",
  "patterns": [
    "Job opportunities after completing M.Sc. Computer Science",
    "Career options with M.Sc Computer Science degree",
    "Jobs after M.Sc Computer Science",
    "msc computer science jobs"
  ],
  "responses": [
    "After completing M.Sc. Computer Science, you can explore various career options. Here are some potential job roles, their average salaries, and the required skills: - SOFTWARE DEVELOPER: Average Salary(LPA) Rs.9,00,000, 4-7 years of experience. Skills Required: Proficiency in programming languages (e.g., Java, Python, C++), software development methodologies, problem-solving abilities. - DATA SCIENTIST: Average Salary(LPA) Rs.8,50,000, 3-6 years of experience. Skills Required: Data analysis skills, machine learning techniques, statistical modeling, programming skills (e.g., Python, R). - SYSTEMS ANALYST: Average Salary(LPA) Rs.8,50,000, 3-6 years of experience. Skills Required: System analysis and design, knowledge of software engineering principles, communication skills. - PROFESSOR OF COMPUTER SCIENCE: Average Salary(LPA) Rs.10,00,000, 5-8 years of experience. Skills Required: Teaching abilities, research experience, strong knowledge of computer science principles. - NETWORK ARCHITECT: Average Salary(LPA) Rs.9,50,000, 4-7 years of experience. Skills Required: Network design and implementation, knowledge of networking protocols, security principles, troubleshooting skills. These figures are approximate and may vary based on location and individual factors."
  ]
},

{
  "tag": "msc_biotechnology_jobs",
  "patterns": [
    "Job opportunities after completing M.Sc. Biotechnology",
    "Career options with M.Sc Biotechnology degree",
    "Jobs after M.Sc Biotechnology",
    "MSc Biotechnology jobs"
  ],
  "responses": [
    "After completing M.Sc. Biotechnology, you can explore various career options. Here are some potential job roles, their average salaries, and the required skills: - BIOTECHNOLOGIST: Average Salary(LPA) Rs.8,50,000, 4-7 years of experience. Skills Required: Molecular biology techniques, genetic engineering, cell culture techniques, bioinformatics. - RESEARCH SCIENTIST (BIOTECHNOLOGY): Average Salary(LPA) Rs.8,00,000, 3-6 years of experience. Skills Required: Research methodologies, experimental design, data analysis, critical thinking. - PHARMACEUTICAL RESEARCHER: Average Salary(LPA) Rs.7,50,000, 2-5 years of experience. Skills Required: Drug development process, pharmacology, analytical techniques, documentation skills. - PROFESSOR OF BIOTECHNOLOGY: Average Salary(LPA) Rs.9,00,000, 5-8 years of experience. Skills Required: Teaching abilities, research experience, knowledge of biotechnological principles. - CLINICAL RESEARCH ASSOCIATE: Average Salary(LPA) Rs.9,50,000, 6-9 years of experience. Skills Required: Clinical trial management, regulatory compliance, data collection and analysis, communication skills. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "msc_environmental_science_jobs",
  "patterns": [
    "Job opportunities after completing M.Sc. Environmental Science",
    "Career options with M.Sc Environmental Science degree",
    "Jobs after M.Sc Environmental Science",
    "msc environmental scienec jobs"
  ],
  "responses": [
    "After completing M.Sc. Environmental Science, you can explore various career options. Here are some potential job roles, their average salaries, and the required skills: - ENVIRONMENTAL SCIENTIST: Average Salary(LPA) Rs.8,00,000, 4-7 years of experience. Skills Required: Environmental monitoring, data analysis, regulatory compliance, report writing. - ENVIRONMENTAL CONSULTANT: Average Salary(LPA) Rs.7,50,000, 3-6 years of experience. Skills Required: Environmental impact assessment, project management, stakeholder engagement, problem-solving. - SUSTAINABILITY CONSULTANT: Average Salary(LPA) Rs.7,50,000, 3-6 years of experience. Skills Required: Sustainability assessment, renewable energy systems, life cycle analysis, communication skills. - PROFESSOR OF ENVIRONMENTAL SCIENCE: Average Salary(LPA) Rs.9,00,000, 5-8 years of experience. Skills Required: Teaching abilities, research experience, knowledge of environmental issues and policies. - WASTE MANAGEMENT SPECIALIST: Average Salary(LPA) Rs.8,50,000, 4-7 years of experience. Skills Required: Waste characterization, recycling programs, pollution prevention techniques, regulatory compliance. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "msc_microbiology_jobs",
  "patterns": [
    "Job opportunities after completing M.Sc. Microbiology",
    "Career options with M.Sc Microbiology degree",
    "Jobs after M.Sc Microbiology",
    "msc microbiology jobs"
  ],
  "responses": [
    "After completing M.Sc. Microbiology, you can explore various career options. Here are some potential job roles, their average salaries, and the required skills: - MICROBIOLOGIST: Average Salary(LPA) Rs.8,00,000, 4-7 years of experience. Skills Required: Microbial culture techniques, molecular biology, data analysis, research methodology. - RESEARCH SCIENTIST (MICROBIOLOGY): Average Salary(LPA) Rs.7,50,000, 3-6 years of experience. Skills Required: Experimental design, laboratory techniques, data interpretation, scientific writing. - CLINICAL MICROBIOLOGIST: Average Salary(LPA) Rs.7,50,000, 3-6 years of experience. Skills Required: Clinical diagnostics, medical microbiology, quality control, communication skills. - PROFESSOR OF MICROBIOLOGY: Average Salary(LPA) Rs.9,00,000, 5-8 years of experience. Skills Required: Teaching abilities, research experience, knowledge of microbiological concepts. - PHARMACEUTICAL RESEARCHER: Average Salary(LPA) Rs.8,50,000, 4-7 years of experience. Skills Required: Drug development, pharmacology, laboratory techniques, project management. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "msc_statistics_jobs",
  "patterns": [
    "Job opportunities after completing M.Sc. Statistics",
    "Career options with M.Sc Statistics degree",
    "Jobs after M.Sc Statistics",
    "msc statistics jobs"
  ],
  "responses": [
    "After completing M.Sc. Statistics, you can explore various career options. Here are some potential job roles, their average salaries, and the required skills: - STATISTICIAN: Average Salary(LPA) Rs.8,50,000, 4-7 years of experience. Skills Required: Statistical analysis, hypothesis testing, data visualization, programming (e.g., R, Python). - DATA SCIENTIST: Average Salary(LPA) Rs.8,00,000, 3-6 years of experience. Skills Required: Data manipulation, machine learning, data visualization, programming skills. - BUSINESS ANALYST: Average Salary(LPA) Rs.7,50,000, 2-5 years of experience. Skills Required: Business acumen, data analysis, problem-solving, communication skills. - PROFESSOR OF STATISTICS: Average Salary(LPA) Rs.9,00,000, 5-8 years of experience. Skills Required: Teaching abilities, research experience, strong statistical knowledge. - ECONOMETRICIAN: Average Salary(LPA) Rs.9,50,000, 6-9 years of experience. Skills Required: Econometrics, statistical modeling, economics knowledge, programming skills. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "ma_english_jobs",
  "patterns": [
    "Job opportunities after completing M.A. English",
    "Career options with M.A English degree",
    "Jobs after M.A English",
    "ma english jobs"
  ],
  "responses": [
    "After completing M.A. English, you can explore various career options. Here are some potential job roles, their average salaries, and the required skills: - ENGLISH PROFESSOR: Average Salary(LPA) Rs.8,50,000, 4-7 years of experience. Skills Required: Teaching abilities, literary analysis, communication skills. - CONTENT WRITER: Average Salary(LPA) Rs.8,00,000, 3-6 years of experience. Skills Required: Writing proficiency, research skills, creativity, SEO knowledge. - EDITOR: Average Salary(LPA) Rs.7,50,000, 2-5 years of experience. Skills Required: Attention to detail, grammar proficiency, editing skills. - COMMUNICATION SPECIALIST: Average Salary(LPA) Rs.9,00,000, 5-8 years of experience. Skills Required: Public speaking, writing, interpersonal skills, strategic communication. - LITERARY AGENT: Average Salary(LPA) Rs.9,50,000, 6-9 years of experience. Skills Required: Negotiation skills, industry knowledge, networking abilities. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "ma_tamil_jobs",
  "patterns": [
    "Job opportunities after completing M.A. Tamil",
    "Career options with M.A Tamil degree",
    "Jobs after M.A Tamil",
    "ma tamil jobs"
  ],
  "responses": [
    "After completing M.A. Tamil, you can explore various career options. Here are some potential job roles, their average salaries, and the required skills: - TAMIL PROFESSOR: Average Salary(LPA) Rs.8,50,000, 4-7 years of experience. Skills Required: Teaching abilities, Tamil literature knowledge, communication skills. - LINGUIST: Average Salary(LPA) Rs.8,00,000, 3-6 years of experience. Skills Required: Language analysis, research skills, critical thinking. - TRANSLATOR: Average Salary(LPA) Rs.7,50,000, 2-5 years of experience. Skills Required: Bilingual proficiency, cultural understanding, attention to detail. - CONTENT WRITER (TAMIL): Average Salary(LPA) Rs.9,00,000, 5-8 years of experience. Skills Required: Writing proficiency, creativity, SEO knowledge. - JOURNALIST (TAMIL): Average Salary(LPA) Rs.9,50,000, 6-9 years of experience. Skills Required: Investigative reporting, storytelling, news writing. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "ma_history_jobs",
  "patterns": [
    "Job opportunities after completing M.A. History",
    "Career options with M.A History degree",
    "Jobs after M.A History",
    "ma history jobs"
  ],
  "responses": [
    "After completing M.A. History, you can explore various career options. Here are some potential job roles, their average salaries, and the required skills: - HISTORY PROFESSOR: Average Salary(LPA) Rs.8,50,000, 4-7 years of experience. Skills Required: Teaching abilities, research skills, historical knowledge. - MUSEUM CURATOR: Average Salary(LPA) Rs.8,00,000, 3-6 years of experience. Skills Required: Collection management, exhibition design, cultural awareness. - HISTORICAL RESEARCHER: Average Salary(LPA) Rs.7,50,000, 2-5 years of experience. Skills Required: Analytical skills, attention to detail, critical thinking. - ARCHIVIST: Average Salary(LPA) Rs.9,00,000, 5-8 years of experience. Skills Required: Record management, preservation techniques, cataloging. - TOUR GUIDE: Average Salary(LPA) Rs.9,50,000, 6-9 years of experience. Skills Required: Communication skills, storytelling, historical knowledge. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "ma_economics_jobs",
  "patterns": [
    "Job opportunities after completing M.A. Economics",
    "Career options with M.A Economics degree",
    "Jobs after M.A Economics",
    "ma economics jobs"
  ],
  "responses": [
    "After completing M.A. Economics, you can explore various career options. Here are some potential job roles, their average salaries, and the required skills: - ECONOMICS PROFESSOR: Average Salary(LPA) Rs.8,50,000, 4-7 years of experience. Skills Required: Teaching abilities, research skills, economic theory. - ECONOMIC ANALYST: Average Salary(LPA) Rs.8,00,000, 3-6 years of experience. Skills Required: Data analysis, economic modeling, report writing. - FINANCIAL CONSULTANT: Average Salary(LPA) Rs.7,50,000, 2-5 years of experience. Skills Required: Financial analysis, risk assessment, client communication. - POLICY ANALYST: Average Salary(LPA) Rs.9,00,000, 5-8 years of experience. Skills Required: Policy analysis, critical thinking, understanding of public policy issues. - INVESTMENT BANKER: Average Salary(LPA) Rs.9,50,000, 6-9 years of experience. Skills Required: Financial modeling, investment analysis, negotiation skills. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "ma_political_science_jobs",
  "patterns": [
    "Job opportunities after completing M.A. Political Science",
    "Career options with M.A Political Science degree",
    "Jobs after M.A Political Science",
    "ma political science jobs"
  ],
  "responses": [
    "After completing M.A. Political Science, you can explore various career options. Here are some potential job roles, their average salaries, and the required skills: - POLITICAL SCIENCE PROFESSOR: Average Salary(LPA) Rs.8,50,000, 4-7 years of experience. Skills Required: Teaching abilities, research skills, political theory. - POLITICAL ANALYST: Average Salary(LPA) Rs.8,00,000, 3-6 years of experience. Skills Required: Data analysis, critical thinking, understanding of political systems. - PUBLIC RELATIONS SPECIALIST: Average Salary(LPA) Rs.7,50,000, 2-5 years of experience. Skills Required: Communication skills, media relations, strategic planning. - POLICY ADVISOR: Average Salary(LPA) Rs.9,00,000, 5-8 years of experience. Skills Required: Policy analysis, political strategy, communication skills. - DIPLOMAT: Average Salary(LPA) Rs.9,50,000, 6-9 years of experience. Skills Required: Negotiation skills, diplomatic etiquette, cultural awareness. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "ma_sociology_jobs",
  "patterns": [
    "Job opportunities after completing M.A. Sociology",
    "Career options with M.A Sociology degree",
    "Jobs after M.A Sociology",
    "ma sociology jobs"
  ],
  "responses": [
    "After completing M.A. Sociology, you can explore various career options. Here are some potential job roles, their average salaries, and the required skills: - SOCIOLOGY PROFESSOR: Average Salary(LPA) Rs.8,50,000, 4-7 years of experience. Skills Required: Teaching abilities, research skills, sociological theory. - SOCIAL WORKER: Average Salary(LPA) Rs.8,00,000, 3-6 years of experience. Skills Required: Empathy, communication skills, social advocacy. - HUMAN RESOURCE SPECIALIST: Average Salary(LPA) Rs.7,50,000, 2-5 years of experience. Skills Required: Recruitment, employee relations, organizational behavior. - COUNSELOR: Average Salary(LPA) Rs.9,00,000, 5-8 years of experience. Skills Required: Counseling techniques, active listening, empathy. - MARKET RESEARCH ANALYST: Average Salary(LPA) Rs.9,50,000, 6-9 years of experience. Skills Required: Data analysis, market research methodologies, critical thinking. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "ma_psychology_jobs",
  "patterns": [
    "Job opportunities after completing M.A. Psychology",
    "Career options with M.A Psychology degree",
    "Jobs after M.A Psychology",
    "master of arts psychology jobs",
    "ma psychology"
  ],
  "responses": [
    "After completing M.A. Psychology, you can explore various career options. Here are some potential job roles, their average salaries, and the required skills: - PSYCHOLOGY PROFESSOR: Average Salary(LPA) Rs.8,50,000, 4-7 years of experience. Skills Required: Teaching abilities, research skills, psychological theories. - CLINICAL PSYCHOLOGIST: Average Salary(LPA) Rs.8,00,000, 3-6 years of experience. Skills Required: Assessment techniques, therapy skills, empathy. - COUNSELING PSYCHOLOGIST: Average Salary(LPA) Rs.7,50,000, 2-5 years of experience. Skills Required: Counseling techniques, active listening, empathy. - INDUSTRIAL-ORGANIZATIONAL PSYCHOLOGIST: Average Salary(LPA) Rs.9,00,000, 5-8 years of experience. Skills Required: Organizational behavior, data analysis, problem-solving. - SCHOOL PSYCHOLOGIST: Average Salary(LPA) Rs.9,50,000, 6-9 years of experience. Skills Required: Assessment and evaluation, counseling skills, understanding of child development. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "mft_jobs",
  "patterns": [
    "Job opportunities after completing M.F.Tech",
    "Career options with M.F.Tech degree",
    "Jobs after M.F.Tech",
    "mftech jobs",
    "master of fashion technology"
  ],
  "responses": [
    "After completing M.F.Tech (Master of Fashion Technology), you can explore various career options in the fashion industry. Here are some potential job roles, their average salaries, and the required skills: - FASHION DESIGNER: Average Salary(LPA) Rs.8,50,000, 4-7 years of experience. Skills Required: Creativity, design software proficiency, understanding of fashion trends. - FASHION MERCHANDISER: Average Salary(LPA) Rs.8,00,000, 3-6 years of experience. Skills Required: Market analysis, negotiation skills, product presentation. - TEXTILE DESIGNER: Average Salary(LPA) Rs.7,50,000, 2-5 years of experience. Skills Required: Textile knowledge, design software proficiency, color theory. - GARMENT TECHNOLOGIST: Average Salary(LPA) Rs.9,00,000, 5-8 years of experience. Skills Required: Technical knowledge of garment production, quality control, problem-solving. - FASHION CONSULTANT: Average Salary(LPA) Rs.9,50,000, 6-9 years of experience. Skills Required: Fashion styling, client management, trend forecasting. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "mba_marketing_jobs",
  "patterns": [
    "Job opportunities after completing MBA in Marketing",
    "Career options with MBA in Marketing degree",
    "Jobs after MBA in Marketing",
    "mba marketing jobs"
  ],
  "responses": [
    "After completing an MBA in Marketing, you can pursue various career paths in the marketing field. Here are some potential job roles, their average salaries, and the required skills: - MARKETING MANAGER: Average Salary(LPA) Rs.10,00,000, 4-7 years of experience. Skills Required: Strategic planning, market analysis, leadership, communication. - BRAND MANAGER: Average Salary(LPA) Rs.8,50,000, 3-5 years of experience. Skills Required: Brand development, campaign management, market research. - SALES MANAGER: Average Salary(LPA) Rs.9,00,000, 4-6 years of experience. Skills Required: Sales strategy, team management, customer relationship management. - DIGITAL MARKETING MANAGER: Average Salary(LPA) Rs.12,00,000, 5-8 years of experience. Skills Required: Digital marketing tools, SEO/SEM, analytics, content strategy. - PRODUCT MANAGER: Average Salary(LPA) Rs.11,00,000, 6-10 years of experience. Skills Required: Product lifecycle management, market trends analysis, cross-functional collaboration. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "mba_hr_jobs",
  "patterns": [
    "Job opportunities after completing MBA in Human Resource Management",
    "Career options with MBA in HR degree",
    "Jobs after MBA HR",
    "mba human resource management jobs"
  ],
  "responses": [
    "After completing an MBA in Human Resource Management, you can pursue various career paths in the HR field. Here are some potential job roles, their average salaries, and the required skills: - HR MANAGER: Average Salary(LPA) Rs.9,00,000, 4-7 years of experience. Skills Required: Employee relations, talent acquisition, performance management, HR strategy. - RECRUITMENT MANAGER: Average Salary(LPA) Rs.8,00,000, 3-5 years of experience. Skills Required: Recruitment techniques, sourcing strategies, candidate assessment. - TRAINING AND DEVELOPMENT MANAGER: Average Salary(LPA) Rs.9,50,000, 4-6 years of experience. Skills Required: Training needs analysis, curriculum development, employee engagement. - HR BUSINESS PARTNER: Average Salary(LPA) Rs.10,00,000, 5-8 years of experience. Skills Required: Business acumen, strategic HR planning, stakeholder management. - COMPENSATION AND BENEFITS MANAGER: Average Salary(LPA) Rs.11,00,000, 6-10 years of experience. Skills Required: Compensation analysis, benefits administration, salary benchmarking. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "mba_it_jobs",
  "patterns": [
    "Job opportunities after completing MBA in Information Technology",
    "Career options with MBA in IT degree",
    "Jobs after MBA in IT",
    "mba it jobs",
    "mba information technology jobs"
  ],
  "responses": [
    "After completing an MBA in Information Technology, you can pursue various career paths in the IT industry. Here are some potential job roles, their average salaries, and the required skills: - IT PROJECT MANAGER: Average Salary(LPA) Rs.12,00,000, 5-8 years of experience. Skills Required: Project management, software development lifecycle, risk management. - IT CONSULTANT: Average Salary(LPA) Rs.10,00,000, 4-7 years of experience. Skills Required: IT strategy consulting, business process improvement, stakeholder management. - SYSTEMS ANALYST: Average Salary(LPA) Rs.9,50,000, 4-6 years of experience. Skills Required: System analysis, requirement gathering, software design. - BUSINESS ANALYST: Average Salary(LPA) Rs.9,00,000, 3-5 years of experience. Skills Required: Business analysis, process modeling, data analysis. - IT MANAGER: Average Salary(LPA) Rs.11,00,000, 6-10 years of experience. Skills Required: IT leadership, budget management, vendor management. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "mba_operations_jobs",
  "patterns": [
    "Job opportunities after completing MBA in Operations Management",
    "Career options with MBA in Operations degree",
    "Jobs after MBA in Operations",
    "mba operations management jobs"
  ],
  "responses": [
    "After completing an MBA in Operations Management, you can explore various career opportunities in operations and supply chain management. Here are some potential job roles, their average salaries, and the required skills: - OPERATIONS MANAGER: Average Salary(LPA) Rs.10,00,000, 4-7 years of experience. Skills Required: Operations planning, process optimization, leadership. - SUPPLY CHAIN MANAGER: Average Salary(LPA) Rs.9,00,000, 3-5 years of experience. Skills Required: Supply chain optimization, inventory management, vendor management. - LOGISTICS MANAGER: Average Salary(LPA) Rs.8,50,000, 3-5 years of experience. Skills Required: Logistics management, transportation planning, warehouse management. - PROCUREMENT MANAGER: Average Salary(LPA) Rs.9,50,000, 4-6 years of experience. Skills Required: Strategic sourcing, contract negotiation, supplier relationship management. - QUALITY ASSURANCE MANAGER: Average Salary(LPA) Rs.10,50,000, 5-8 years of experience. Skills Required: Quality management systems, continuous improvement methodologies, regulatory compliance. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "mtech_cse_jobs",
  "patterns": [
    "Job opportunities after completing M.Tech. Computer Science and Engineering",
    "Career options with M.Tech. CSE degree",
    "Jobs after M.Tech CSE",
    "mtech cse jobs",
    "m.e computer science engineering",
    "me computer science engineering",
    "me cse",
    "m.e cse",
    "mtech computer science engineering jobs",
    "m.tech computer science engineering jobs"
  ],
  "responses": [
    "After completing an M.Tech. in Computer Science and Engineering, you can pursue various career paths in the field of technology and computer science. Here are some potential job roles, their average salaries, and the required skills: - SOFTWARE DEVELOPMENT ENGINEER: Average Salary(LPA) Rs.14,00,000, 6-10 years of experience. Skills Required: Proficiency in programming languages (e.g., Java, Python), software design and development, problem-solving skills. - MACHINE LEARNING ENGINEER: Average Salary(LPA) Rs.15,00,000, 7-12 years of experience. Skills Required: Machine learning algorithms, data analysis, programming skills (e.g., Python, R), deep learning frameworks (e.g., TensorFlow, PyTorch). - COMPUTER NETWORK ARCHITECT: Average Salary(LPA) Rs.13,00,000, 5-8 years of experience. Skills Required: Network design and implementation, network security, knowledge of network protocols (e.g., TCP/IP, DNS). - DATABASE ADMINISTRATOR: Average Salary(LPA) Rs.12,00,000, 4-7 years of experience. Skills Required: Database management systems (e.g., MySQL, Oracle), SQL query optimization, database security. - SYSTEMS ARCHITECT: Average Salary(LPA) Rs.16,00,000, 8-12 years of experience. Skills Required: System design and architecture, cloud computing platforms (e.g., AWS, Azure), scalability and performance optimization. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "mtech_eee_jobs",
  "patterns": [
    "Job opportunities after completing M.Tech. Electrical and Electronics Engineering",
    "Career options with M.Tech. EEE degree",
    "Jobs after M.Tech EEE",
    "mtech electrical and electronics engineering jobs",
    "m.tech eee",
    "m.e eee",
    "me eee"
  ],
  "responses": [
    "After completing an M.Tech. in Electrical and Electronics Engineering, you can pursue various career paths in the field of electrical and electronics engineering. Here are some potential job roles, their average salaries, and the required skills: - ELECTRICAL ENGINEER: Average Salary(LPA) Rs.12,00,000, 5-8 years of experience. Skills Required: Electrical circuit design, power systems analysis, knowledge of electrical codes and standards. - ELECTRONICS ENGINEER: Average Salary(LPA) Rs.11,00,000, 4-7 years of experience. Skills Required: Electronic circuit design, PCB design, proficiency in electronic design automation (EDA) tools. - POWER ENGINEER: Average Salary(LPA) Rs.13,00,000, 6-10 years of experience. Skills Required: Power system analysis, renewable energy systems, grid integration. - CONTROL SYSTEMS ENGINEER: Average Salary(LPA) Rs.14,00,000, 7-12 years of experience. Skills Required: Control system design, feedback control theory, proficiency in MATLAB/Simulink. - AUTOMATION ENGINEER: Average Salary(LPA) Rs.12,50,000, 6-9 years of experience. Skills Required: Automation system design, PLC programming, knowledge of industrial communication protocols (e.g., Modbus, Profibus). These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "mtech_mechanical_jobs",
  "patterns": [
    "Job opportunities after completing M.Tech. Mechanical Engineering",
    "Career options with M.Tech. Mechanical degree",
    "Jobs after M.Tech Mechanical enginneering",
    "mtech mechanical engineering",
    "m.e mechanical engineering",
    "me mechanical engineering"
  ],
  "responses": [
    "After completing an M.Tech. in Mechanical Engineering, you can pursue various career paths in the field of mechanical engineering. Here are some potential job roles, their average salaries, and the required skills: - MECHANICAL ENGINEER: Average Salary(LPA) Rs.12,00,000, 5-8 years of experience. Skills Required: Solid mechanics, fluid dynamics, proficiency in CAD/CAM software. - DESIGN ENGINEER: Average Salary(LPA) Rs.11,00,000, 4-7 years of experience. Skills Required: Engineering design principles, proficiency in computer-aided design (CAD) software, knowledge of finite element analysis (FEA). - MANUFACTURING ENGINEER: Average Salary(LPA) Rs.13,00,000, 6-10 years of experience. Skills Required: Manufacturing processes, production planning, knowledge of lean manufacturing principles. - THERMAL ANALYST: Average Salary(LPA) Rs.14,00,000, 7-12 years of experience. Skills Required: Thermal analysis, heat transfer principles, proficiency in computational fluid dynamics (CFD) software. - PROJECT MANAGER: Average Salary(LPA) Rs.15,00,000, 8-12 years of experience. Skills Required: Project management, leadership, communication, risk management. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "mtech_civil_jobs",
  "patterns": [
    "Job opportunities after completing M.Tech. Civil Engineering",
    "Career options with M.Tech. Civil degree",
    "Jobs after M.Tech Civil",
    "mtech civil engineering jobs",
    "m.tech civil engineering",
    "me civil engineering",
    "m.e civil engineering"
  ],
  "responses": [
    "After completing an M.Tech. in Civil Engineering, you can pursue various career paths in the field of civil engineering. Here are some potential job roles, their average salaries, and the required skills: - CIVIL ENGINEER: Average Salary(LPA) Rs.12,00,000, 5-8 years of experience. Skills Required: Structural design, construction management, knowledge of building codes and regulations. - STRUCTURAL ENGINEER: Average Salary(LPA) Rs.11,00,000, 4-7 years of experience. Skills Required: Structural analysis, proficiency in structural engineering software, understanding of seismic design principles. - TRANSPORTATION ENGINEER: Average Salary(LPA) Rs.13,00,000, 6-10 years of experience. Skills Required: Transportation planning, traffic engineering, familiarity with transportation modeling software. - ENVIRONMENTAL ENGINEER: Average Salary(LPA) Rs.14,00,000, 7-12 years of experience. Skills Required: Environmental impact assessment, pollution control technologies, regulatory compliance. - PROJECT MANAGER: Average Salary(LPA) Rs.15,00,000, 8-12 years of experience. Skills Required: Project management, leadership, communication, budgeting, scheduling. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "mtech_ece_jobs",
  "patterns": [
    "Job opportunities after completing M.Tech. Electronics and Communication Engineering",
    "Career options with M.Tech. ECE degree",
    "Jobs after M.Tech ECE",
    "MTech Electronics and Communication Engineering",
    "m.tech Electronics and Communication Engineering",
    "m.e Electronics and Communication Engineering",
    "me Electronics and Communication Engineering",
    "me ece",
    "m.e ece",
    "M.Tech ECE",
    "MTech ECE"
  ],
  "responses": [
    "After completing an M.Tech. in Electronics and Communication Engineering, you can explore various career opportunities in the field. Here are some potential job roles, their average salaries, and the required skills: - ELECTRONICS ENGINEER: Average Salary(LPA) Rs.12,00,000, 5-8 years of experience. Skills Required: Circuit design, analog and digital electronics, PCB layout design. - COMMUNICATIONS ENGINEER: Average Salary(LPA) Rs.11,00,000, 4-7 years of experience. Skills Required: Communication systems design, modulation techniques, wireless protocols. - SIGNAL PROCESSING ENGINEER: Average Salary(LPA) Rs.13,00,000, 6-10 years of experience. Skills Required: Digital signal processing, statistical signal processing, MATLAB programming. - VLSI DESIGN ENGINEER: Average Salary(LPA) Rs.14,00,000, 7-12 years of experience. Skills Required: VLSI design methodologies, Verilog/VHDL programming, ASIC/FPGA design flow. - TELECOMMUNICATIONS ENGINEER: Average Salary(LPA) Rs.15,00,000, 8-12 years of experience. Skills Required: Network design, RF engineering, telecommunication standards. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "mca_jobs",
  "patterns": [
    "Job opportunities after completing MCA",
    "Career options with MCA degree",
    "Jobs after MCA",
    "master of computer application"
  ],
  "responses": [
    "After completing an MCA (Master of Computer Application), you can explore various career opportunities in the field of information technology. Here are some potential job roles, their average salaries, and the required skills: - SOFTWARE DEVELOPER: Average Salary(LPA) Rs.8,00,000, 3-6 years of experience. Skills Required: Proficiency in programming languages like Java, C#, Python, knowledge of software development methodologies. - SYSTEMS ANALYST: Average Salary(LPA) Rs.7,50,000, 2-5 years of experience. Skills Required: Strong analytical skills, understanding of system architecture, ability to analyze user requirements. - DATABASE ADMINISTRATOR: Average Salary(LPA) Rs.8,50,000, 3-6 years of experience. Skills Required: Proficiency in database management systems like SQL Server, Oracle, MySQL, database design and optimization. - NETWORK ENGINEER: Average Salary(LPA) Rs.9,00,000, 4-7 years of experience. Skills Required: Networking concepts, TCP/IP protocols, network security, Cisco certifications. - APPLICATION DEVELOPER: Average Salary(LPA) Rs.9,50,000, 5-8 years of experience. Skills Required: Mobile or web application development skills, knowledge of frameworks like Angular, React, Android, or iOS development. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "msw_jobs",
  "patterns": [
    "Job opportunities after completing MSW",
    "Career options with MSW degree",
    "Jobs after MSW",
    "master of social work jobs"
  ],
  "responses": [
    "After completing an MSW (Master of Social Work), you can explore various career opportunities in the field of social services and community development. Here are some potential job roles, their average salaries, and the required skills: - SOCIAL WORKER: Average Salary(LPA) Rs.7,00,000, 3-6 years of experience. Skills Required: Empathy, communication skills, advocacy, case management, and knowledge of social welfare policies and programs. - COUNSELOR: Average Salary(LPA) Rs.6,50,000, 2-5 years of experience. Skills Required: Counseling skills, active listening, empathy, knowledge of therapeutic techniques. - COMMUNITY SERVICE MANAGER: Average Salary(LPA) Rs.7,50,000, 3-6 years of experience. Skills Required: Leadership, organizational skills, project management, community engagement, and understanding of social issues. - HUMAN SERVICES SPECIALIST: Average Salary(LPA) Rs.8,00,000, 4-7 years of experience. Skills Required: Knowledge of social services, client assessment, resource coordination, advocacy, and communication skills. - PROGRAM MANAGER (NON-PROFIT): Average Salary(LPA) Rs.8,50,000, 5-8 years of experience. Skills Required: Project management, leadership, fundraising, stakeholder engagement, budgeting, and program evaluation. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "mcom_jobs",
  "patterns": [
    "Job opportunities after completing M.Com",
    "Career options with M.Com degree",
    "Jobs after M.Com",
    "mcom",
    "master of commerce"
  ],
  "responses": [
    "After completing an M.Com (Master of Commerce), you can explore various career opportunities in the field of accounting, finance, and taxation. Here are some potential job roles, their average salaries, and the required skills: - ACCOUNTANT: Average Salary(LPA) Rs.7,50,000, 3-6 years of experience. Skills Required: Knowledge of accounting principles, financial reporting, proficiency in accounting software, attention to detail. - FINANCIAL ANALYST: Average Salary(LPA) Rs.8,00,000, 4-7 years of experience. Skills Required: Financial analysis, forecasting, investment evaluation, proficiency in financial modeling, analytical skills. - AUDITOR: Average Salary(LPA) Rs.7,00,000, 2-5 years of experience. Skills Required: Audit procedures, risk assessment, attention to detail, knowledge of auditing standards and regulations. - TAX CONSULTANT: Average Salary(LPA) Rs.8,50,000, 5-8 years of experience. Skills Required: Tax planning, compliance, knowledge of tax laws, communication skills, problem-solving abilities. - TREASURY ANALYST: Average Salary(LPA) Rs.9,00,000, 6-9 years of experience. Skills Required: Cash management, liquidity planning, financial risk management, proficiency in treasury management systems, analytical skills. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "mpharm_jobs",
  "patterns": [
    "Job opportunities after completing M.Pharm",
    "Career options with M.Pharm degree",
    "Jobs after M.Pharm",
    "mpharm jobs",
    "master of pharmacy"
  ],
  "responses": [
    "After completing an M.Pharm (Master of Pharmacy), you can explore various career opportunities in the pharmaceutical industry. Here are some potential job roles, their average salaries, and the required skills: - PHARMACEUTICAL RESEARCHER: Average Salary(LPA) Rs.9,00,000, 4-7 years of experience. Skills Required: Research methodology, data analysis, knowledge of pharmaceutical sciences, critical thinking. - PHARMACIST: Average Salary(LPA) Rs.8,50,000, 3-5 years of experience. Skills Required: Dispensing medications, patient counseling, knowledge of drug interactions, communication skills. - PHARMACEUTICAL MANUFACTURING MANAGER: Average Salary(LPA) Rs.8,80,000, 3-6 years of experience. Skills Required: Manufacturing processes, quality control, regulatory compliance, leadership skills. - REGULATORY AFFAIRS MANAGER: Average Salary(LPA) Rs.9,50,000, 4-6 years of experience. Skills Required: Regulatory compliance, knowledge of drug approval processes, attention to detail, communication skills. - CLINICAL RESEARCH ASSOCIATE: Average Salary(LPA) Rs.10,00,000, 5-8 years of experience. Skills Required: Clinical trial management, protocol adherence, data collection and analysis, organizational skills. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "bpharm_jobs",
  "patterns": [
    "Job opportunities after B.Pharm",
    "Career options with B.Pharm degree",
    "Jobs after completing B.Pharm",
    "bpharm jobs"
  ],
  "responses": [
    "After completing a B.Pharm (Bachelor of Pharmacy), you can explore various career opportunities in the pharmaceutical industry. Here are some potential job roles, their average salaries, and the required skills: - PHARMACEUTICAL RESEARCHER: Average Salary(LPA) Rs.8,00,000, 2-5 years of experience. Skills Required: Research methodology, data analysis, knowledge of pharmaceutical sciences, critical thinking. - PHARMACIST: Average Salary(LPA) Rs.7,50,000, 2-4 years of experience. Skills Required: Dispensing medications, patient counseling, knowledge of drug interactions, communication skills. - PHARMACEUTICAL MANUFACTURING MANAGER: Average Salary(LPA) Rs.7,80,000, 2-5 years of experience. Skills Required: Manufacturing processes, quality control, regulatory compliance, leadership skills. - REGULATORY AFFAIRS MANAGER: Average Salary(LPA) Rs.7,50,000, 2-4 years of experience. Skills Required: Regulatory compliance, knowledge of drug approval processes, attention to detail, communication skills. - CLINICAL RESEARCH ASSOCIATE: Average Salary(LPA) Rs.7,00,000, 2-4 years of experience. Skills Required: Clinical trial management, protocol adherence, data collection and analysis, organizational skills. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "pgdm_jobs",
  "patterns": [
    "Job opportunities after completing PGDM",
    "Career options with PGDM degree",
    "Jobs after PGDM",
    "PGDM jobs",
    "Post Graduate Diploma in Management jobs"
  ],
  "responses": [
    "After completing PGDM (Post Graduate Diploma in Management), you can explore various career opportunities in management and related fields. Here are some potential job roles, their average salaries, and the required experience: - MARKETING MANAGER: Average Salary(LPA) Rs.15,00,000, 4-7 years of experience. Skills Required: Strategic planning, market analysis, leadership skills, communication skills. - FINANCIAL ANALYST: Average Salary(LPA) Rs.14,00,000, 3-5 years of experience. Skills Required: Financial analysis, forecasting, investment analysis, attention to detail. - HUMAN RESOURCE MANAGER: Average Salary(LPA) Rs.13,00,000, 3-6 years of experience. Skills Required: Recruitment, employee relations, performance management, HR strategy development. - OPERATIONS MANAGER: Average Salary(LPA) Rs.14,50,000, 4-6 years of experience. Skills Required: Operations management, supply chain management, process improvement, problem-solving. - BUSINESS DEVELOPMENT MANAGER: Average Salary(LPA) Rs.15,50,000, 5-8 years of experience. Skills Required: Business strategy development, client relationship management, negotiation skills, networking. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "emba_jobs",
  "patterns": [
    "Job opportunities after completing EMBA",
    "Career options with EMBA degree",
    "Jobs after EMBA",
    "EMBA jobs",
    "Executive Master of Business Administration"
  ],
  "responses": [
    "After completing an EMBA (Executive Master of Business Administration), you can explore executive-level positions in various industries. Here are some potential job roles, their average salaries, and the required experience: - EXECUTIVE DIRECTOR: Average Salary(LPA) Rs.25,00,000, 8-12 years of experience. Skills Required: Strategic planning, leadership, financial management, decision-making. - CHIEF EXECUTIVE OFFICER (CEO): Average Salary(LPA) Rs.30,00,000, 10-15 years of experience. Skills Required: Visionary leadership, corporate strategy, stakeholder management, crisis management. - CHIEF OPERATING OFFICER (COO): Average Salary(LPA) Rs.28,00,000, 10-14 years of experience. Skills Required: Operations management, process optimization, organizational development, problem-solving. - CHIEF FINANCIAL OFFICER (CFO): Average Salary(LPA) Rs.29,00,000, 10-14 years of experience. Skills Required: Financial planning, budgeting, risk management, regulatory compliance. - CHIEF MARKETING OFFICER (CMO): Average Salary(LPA) Rs.27,00,000, 10-13 years of experience. Skills Required: Marketing strategy, branding, market research, customer relationship management. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "diploma_eng_jobs",
  "patterns": [
    "Job opportunities after Diploma in Engineering",
    "Career options with Diploma in Engineering",
    "Jobs after completing Diploma in Engineering",
    "diploma engineering"
  ],
  "responses": [
    "After completing a Diploma in Engineering, you can explore various job opportunities in the field. Here are some potential career options, along with their average salaries and required experience: - JUNIOR ENGINEER: Average Salary(LPA) Rs.4,50,000, 1-3 years of experience. Skills Required: Technical knowledge, problem-solving, teamwork. - TECHNICIAN: Average Salary(LPA) Rs.4,00,000, 1-3 years of experience. Skills Required: Equipment maintenance, troubleshooting, attention to detail. - DESIGN ENGINEER: Average Salary(LPA) Rs.5,00,000, 2-4 years of experience. Skills Required: CAD software proficiency, design principles, creativity. - MAINTENANCE TECHNICIAN: Average Salary(LPA) Rs.4,20,000, 1-3 years of experience. Skills Required: Equipment maintenance, repair skills, ability to work under pressure. - ELECTRICAL ENGINEERING TECHNICIAN: Average Salary(LPA) Rs.4,30,000, 1-3 years of experience. Skills Required: Electrical systems knowledge, troubleshooting, attention to safety protocols. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "diploma_pharm_jobs",
  "patterns": [
    "Job opportunities after Diploma in Pharmacy",
    "Career options with Diploma in Pharmacy",
    "Jobs after completing Diploma in Pharmacy",
    "diploma pharmacy jobs"
  ],
  "responses": [
    "After completing a Diploma in Pharmacy, you can explore various career opportunities in the pharmaceutical sector. Here are some potential job roles, their average salaries, required experience, and skills: - PHARMACY TECHNICIAN: Average Salary(LPA) Rs.3,80,000, 1-3 years of experience. Skills Required: Knowledge of pharmaceuticals, attention to detail, communication skills. - HOSPITAL PHARMACY TECHNICIAN: Average Salary(LPA) Rs.4,00,000, 1-3 years of experience. Skills Required: Familiarity with hospital procedures, dispensing medication, teamwork. - RETAIL PHARMACIST: Average Salary(LPA) Rs.4,20,000, 2-4 years of experience. Skills Required: Medication dispensing, customer service, knowledge of healthcare regulations. - PHARMACEUTICAL SALES REPRESENTATIVE: Average Salary(LPA) Rs.4,50,000, 2-4 years of experience. Skills Required: Salesmanship, product knowledge, communication skills. - PHARMACEUTICAL MANUFACTURING TECHNICIAN: Average Salary(LPA) Rs.4,30,000, 1-3 years of experience. Skills Required: Manufacturing processes, quality control, adherence to safety protocols."
  ]
},
{
  "tag": "diploma_hotel_mgmt_jobs",
  "patterns": [
    "Job opportunities after Diploma in Hotel Management",
    "Career options with Diploma in Hotel Management",
    "Jobs after completing Diploma in Hotel Management",
    "diploma hotel management"
  ],
  "responses": [
    "After completing a Diploma in Hotel Management, you can explore various career opportunities in the hospitality industry. Here are some potential job roles, their average salaries, required experience, and skills: - FRONT DESK OFFICER: Average Salary(LPA) Rs.3,50,000, 1-3 years of experience. Skills Required: Communication skills, customer service, organizational skills. - HOTEL SUPERVISOR: Average Salary(LPA) Rs.3,80,000, 1-3 years of experience. Skills Required: Leadership, problem-solving, attention to detail. - EVENT PLANNER: Average Salary(LPA) Rs.3,60,000, 1-3 years of experience. Skills Required: Creativity, organizational skills, attention to detail. - GUEST SERVICE AGENT: Average Salary(LPA) Rs.3,40,000, 1-3 years of experience. Skills Required: Communication skills, customer service, problem-solving. - RESTAURANT MANAGER: Average Salary(LPA) Rs.4,00,000, 2-4 years of experience. Skills Required: Leadership, team management, financial acumen."
  ]
},
{
  "tag": "diploma_edu_jobs",
  "patterns": [
    "Job opportunities after Diploma in Education (D.Ed)",
    "Career options with D.Ed",
    "Jobs after completing D.Ed",
    "ded jobs"
  ],
  "responses": [
    "After completing a Diploma in Education (D.Ed), you can explore various career opportunities in the field of education. Here are some potential job roles, their average salaries, required experience, and skills: - ELEMENTARY SCHOOL TEACHER: Average Salary(LPA) Rs.3,50,000, 1-3 years of experience. Skills Required: Classroom management, lesson planning, communication skills. - SPECIAL EDUCATION TEACHER: Average Salary(LPA) Rs.3,80,000, 1-3 years of experience. Skills Required: Special education techniques, patience, empathy. - PRESCHOOL TEACHER: Average Salary(LPA) Rs.3,60,000, 1-3 years of experience. Skills Required: Early childhood education, creativity, patience. - EDUCATIONAL CONSULTANT: Average Salary(LPA) Rs.3,40,000, 1-3 years of experience. Skills Required: Educational assessment, communication skills, problem-solving. - SCHOOL ADMINISTRATOR: Average Salary(LPA) Rs.4,00,000, 2-4 years of experience. Skills Required: Leadership, organizational skills, decision-making."
  ]
},
{
  "tag": "dca_jobs",
  "patterns": [
    "Job opportunities after Diploma in Computer Applications (DCA)",
    "Career options with DCA",
    "Jobs after completing DCA",
    "dca jobs",
    "Diploma Computer Applications"
  ],
  "responses": [
    "After completing a Diploma in Computer Applications (DCA), you can explore various job opportunities in the field of information technology. Here are some potential job roles, their average salaries, required experience, and skills: - COMPUTER TECHNICIAN: Average Salary(LPA) Rs.4,00,000, 1-3 years of experience. Skills Required: Hardware troubleshooting, computer assembly, technical support. - DATA ENTRY OPERATOR: Average Salary(LPA) Rs.3,50,000, 1-3 years of experience. Skills Required: Typing speed, attention to detail, data management. - IT SUPPORT TECHNICIAN: Average Salary(LPA) Rs.4,20,000, 2-4 years of experience. Skills Required: Technical support, troubleshooting, customer service. - WEB DEVELOPER: Average Salary(LPA) Rs.4,50,000, 2-4 years of experience. Skills Required: HTML, CSS, JavaScript, web development frameworks. - SOFTWARE SUPPORT ENGINEER: Average Salary(LPA) Rs.4,30,000, 1-3 years of experience. Skills Required: Software troubleshooting, technical support, problem-solving."
  ]
},
{
  "tag": "btech_ai_ds_jobs",
  "patterns": [
    "Job opportunities after B.Tech in Artificial Intelligence and Data Science",
    "Career options with B.Tech AI/DS degree",
    "Jobs after completing AI and Data Science course",
    "btech ai/ds jobs",
    "b.tech ai/ds"
  ],
  "responses": [
    "After completing a B.Tech in Artificial Intelligence and Data Science, you can pursue various career paths in the field of data science and machine learning. Here are some potential job roles, their average salaries, and the required skills: - DATA SCIENTIST: Average Salary(LPA) Rs.10,00,000, 2-5 years of experience. Skills Required: Proficiency in programming languages like Python, R, SQL. Strong understanding of statistical concepts and machine learning algorithms. Data visualization skills using tools like Tableau or Matplotlib. - MACHINE LEARNING ENGINEER: Average Salary(LPA) Rs.9,50,000, 2-4 years of experience. Skills Required: Knowledge of machine learning algorithms and frameworks like TensorFlow, PyTorch, or scikit-learn. Proficiency in programming languages such as Python or Java. Understanding of data structures and algorithms. - ARTIFICIAL INTELLIGENCE ENGINEER: Average Salary(LPA) Rs.9,80,000, 2-5 years of experience. Skills Required: Deep understanding of AI concepts, including neural networks, deep learning, and natural language processing. Proficiency in programming languages such as Python, Java, or C++. Experience with AI frameworks like TensorFlow or Keras. - BIG DATA ENGINEER: Average Salary(LPA) Rs.9,50,000, 2-4 years of experience. Skills Required: Proficiency in big data technologies like Hadoop, Spark, or Kafka. Knowledge of programming languages such as Java, Scala, or Python. Experience with data warehousing and ETL processes. - BUSINESS INTELLIGENCE ANALYST: Average Salary(LPA) Rs.9,00,000, 2-4 years of experience. Skills Required: Strong analytical skills and ability to interpret data. Proficiency in SQL and data visualization tools like Tableau or Power BI. Understanding of business processes and domain knowledge. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "btech_aero_engg_jobs",
  "patterns": [
    "Job opportunities after completing B.Tech in Aeronautical Engineering",
    "Career options with B.Tech Aeronautical Engineering degree",
    "Jobs after B.Tech Aeronautical Engineering jobs",
    "btech aeronautical engineering jobs",
    "b.tech aeronautical engineerinng",
    "b.e aeronautical engineering",
    "be aeronautical engineering"
  ],
  "responses": [
    "After completing a B.Tech in Aeronautical Engineering, you can explore various career opportunities in the aerospace industry. Here are some potential job roles, their average salaries, and the required skills: - AEROSPACE ENGINEER: Average Salary(LPA) Rs.7,00,000, 3-6 years of experience. Skills Required: Knowledge of aircraft design principles, aerodynamics, and propulsion systems. Proficiency in CAD software like CATIA or SolidWorks. Strong problem-solving and analytical skills. - AIRCRAFT MAINTENANCE ENGINEER: Average Salary(LPA) Rs.6,50,000, 2-5 years of experience. Skills Required: Ability to troubleshoot and repair aircraft systems. Knowledge of aircraft maintenance regulations and procedures. Attention to detail and strong technical skills. - AVIONICS ENGINEER: Average Salary(LPA) Rs.6,80,000, 3-6 years of experience. Skills Required: Understanding of avionics systems such as navigation, communication, and flight control systems. Proficiency in software development and embedded systems. Knowledge of electronic circuits and signal processing. - FLIGHT TEST ENGINEER: Average Salary(LPA) Rs.7,20,000, 4-7 years of experience. Skills Required: Experience in conducting flight tests and analyzing data. Knowledge of aircraft performance metrics and flight dynamics. Strong communication and reporting skills. - AERODYNAMICS ENGINEER: Average Salary(LPA) Rs.6,50,000, 3-6 years of experience. Skills Required: Understanding of aerodynamic principles and their application in aircraft design. Proficiency in computational fluid dynamics (CFD) software. Strong mathematical and analytical skills. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "btech_auto_engg_jobs",
  "patterns": [
    "Job opportunities after completing B.Tech in Automobile Engineering",
    "Career options with B.Tech Automobile Engineering degree",
    "Jobs after B.Tech in Automobile Engineering",
    "btech automobile jobs",
    "btech automobile engineering",
    "b.tech automobile engineering",
    "b.e automobile engineering",
    "be automobile engineering"
  ],
  "responses": [
    "After completing a B.Tech in Automobile Engineering, you can explore various job opportunities in the automotive industry. Here are some potential career options, along with their average salaries, required experience, and skills: - AUTOMOTIVE ENGINEER: Average Salary(LPA) Rs.6,00,000, 2-5 years of experience. Skills Required: Automotive design principles, vehicle dynamics, CAD software proficiency, problem-solving skills. - AUTOMOBILE DESIGN ENGINEER: Average Salary(LPA) Rs.5,80,000, 2-5 years of experience. Skills Required: AutoCAD, CATIA, vehicle design fundamentals, attention to detail. - PRODUCTION PLANNING ENGINEER: Average Salary(LPA) Rs.5,50,000, 2-5 years of experience. Skills Required: Production scheduling, supply chain management, lean manufacturing principles, communication skills. - AUTOMOBILE SERVICE ENGINEER: Average Salary(LPA) Rs.5,70,000, 2-5 years of experience. Skills Required: Automotive diagnostics, repair and maintenance techniques, customer service, troubleshooting abilities. - TESTING ENGINEER (AUTOMOBILE): Average Salary(LPA) Rs.5,90,000, 2-5 years of experience. Skills Required: Testing methodologies, data analysis, vehicle testing protocols, attention to detail."
  ]
},
{
  "tag": "btech_biotech_jobs",
  "patterns": [
    "Job opportunities after completing B.Tech in Biotechnology",
    "Career options with B.Tech Biotechnology degree",
    "Jobs after B.Tech in Biotechnology",
    "BTECH BIOTECHNOLOGY",
    "btech biotech jobs",
    "B.TECH BIOTECHNOLOGY",
    "B.E BIOTECHNOLOGY",
    "be BIOTECHNOLOGY"
  ],
  "responses": [
    "After completing a B.Tech in Biotechnology, you can explore various job opportunities in the biotechnology and related industries. Here are some potential career options, along with their average salaries, required experience, and skills: - BIOTECHNOLOGIST: Average Salary(LPA) Rs.5,50,000, 2-5 years of experience. Skills Required: Molecular biology techniques, cell culture, bioinformatics, research methodology. - RESEARCH SCIENTIST (BIOTECH): Average Salary(LPA) Rs.6,00,000, 2-5 years of experience. Skills Required: Experimental design, data analysis, laboratory techniques, critical thinking. - BIOINFORMATICIAN: Average Salary(LPA) Rs.5,80,000, 2-5 years of experience. Skills Required: Computational biology, bioinformatics tools, programming languages (e.g., Python, R), statistical analysis. - PHARMACEUTICAL BIOCHEMIST: Average Salary(LPA) Rs.5,70,000, 2-5 years of experience. Skills Required: Biochemical assays, drug development processes, analytical techniques, attention to detail. - MEDICAL LABORATORY TECHNICIAN: Average Salary(LPA) Rs.5,40,000, 2-5 years of experience. Skills Required: Laboratory equipment operation, specimen handling, medical terminology, quality control procedures."
  ]
},
{
  "tag": "bsc_environmental_science_jobs",
  "patterns": [
    "Job opportunities after completing B.Sc. Environmental Science",
    "Career options with B.Sc. Environmental Science degree",
    "Jobs after B.Sc Environmental Science",
    "BSc Environmental Science"
  ],
  "responses": [
    "After completing a B.Sc. in Environmental Science, you can explore various career opportunities in the environmental sector. Here are some potential job roles, their average salaries, required experience, and skills: - ENVIRONMENTAL SCIENTIST: Average Salary Rs.8,50,000 per annum, 3-6 years of experience. Skills Required: Environmental monitoring, data analysis, research methods, regulatory compliance. - ECOLOGIST: Average Salary Rs.8,20,000 per annum, 2-5 years of experience. Skills Required: Ecological assessment, habitat restoration, biodiversity conservation, field research techniques. - WILDLIFE BIOLOGIST: Average Salary Rs.8,80,000 per annum, 3-6 years of experience. Skills Required: Wildlife ecology, population dynamics, conservation biology, GIS (Geographic Information Systems). - SUSTAINABILITY CONSULTANT: Average Salary Rs.8,50,000 per annum, 3-5 years of experience. Skills Required: Sustainability assessment, green technology implementation, stakeholder engagement, project management. - ENVIRONMENTAL EDUCATOR: Average Salary Rs.9,00,000 per annum, 4-7 years of experience. Skills Required: Curriculum development, teaching methodologies, environmental awareness programs, communication skills."
  ]
},
{
  "tag": "bsc_microbiology_jobs",
  "patterns": [
    "Job opportunities after completing B.Sc. Microbiology",
    "Career options with B.Sc. Microbiology degree",
    "Jobs after B.Sc Microbiology",
    "BSc Microbiology"
  ],
  "responses": [
    "After completing a B.Sc. in Microbiology, you can explore various career opportunities in the field of microbiology and related industries. Here are some potential job roles, their average salaries, required experience, and skills: - MICROBIOLOGIST: Average Salary Rs.9,50,000 per annum, 4-7 years of experience. Skills Required: Microbial culture techniques, molecular biology, data analysis, laboratory safety protocols. - MEDICAL LAB TECHNICIAN: Average Salary Rs.9,00,000 per annum, 3-6 years of experience. Skills Required: Laboratory testing, specimen collection, quality control, knowledge of medical terminology. - PHARMACEUTICAL SALES REPRESENTATIVE: Average Salary Rs.8,80,000 per annum, 3-5 years of experience. Skills Required: Sales techniques, product knowledge, customer relationship management, communication skills. - RESEARCH ASSISTANT: Average Salary Rs.8,50,000 per annum, 2-4 years of experience. Skills Required: Research methodologies, data collection and analysis, laboratory techniques, attention to detail. - FOOD TECHNOLOGIST: Average Salary Rs.9,20,000 per annum, 4-6 years of experience. Skills Required: Food safety regulations, product development, quality assurance, sensory evaluation."
  ]
},
{
  "tag": "bsc_statistics_jobs",
  "patterns": [
    "Job opportunities after completing B.Sc. Statistics",
    "Career options with B.Sc. Statistics degree",
    "Jobs after B.Sc Statistics",
    "Bsc Statistics"
  ],
  "responses": [
    "After completing a B.Sc. in Statistics, you can explore various career opportunities in data analysis, research, and related fields. Here are some potential job roles, their average salaries, required experience, and skills: - STATISTICIAN: Average Salary Rs.8,50,000 per annum, 3-6 years of experience. Skills Required: Statistical analysis, hypothesis testing, regression modeling, proficiency in statistical software. - DATA ANALYST: Average Salary Rs.8,20,000 per annum, 2-5 years of experience. Skills Required: Data cleaning, data visualization, statistical analysis, proficiency in programming languages like R or Python. - RESEARCH ANALYST: Average Salary Rs.8,80,000 per annum, 3-6 years of experience. Skills Required: Research methodologies, data collection and analysis, critical thinking, problem-solving. - ACTUARY: Average Salary Rs.8,50,000 per annum, 3-5 years of experience. Skills Required: Risk assessment, mathematical modeling, financial analysis, proficiency in statistical software. - BUSINESS INTELLIGENCE ANALYST: Average Salary Rs.9,00,000 per annum, 4-7 years of experience. Skills Required: Business acumen, data interpretation, report generation, proficiency in business intelligence tools."
  ]
},
{
  "tag": "ba_english_jobs",
  "patterns": [
    "Job opportunities after completing B.A. English",
    "Career options with B.A. English degree",
    "Jobs after B.A English",
    "ba english"
  ],
  "responses": [
    "After completing a B.A. in English, you can explore various career opportunities in writing, editing, teaching, and related fields. Here are some potential job roles, their average salaries, required experience, and skills: - CONTENT WRITER: Average Salary Rs.7,50,000 per annum, 1-3 years of experience. Skills Required: Excellent writing skills, creativity, research abilities, attention to detail. - EDITOR: Average Salary Rs.7,00,000 per annum, 1-3 years of experience. Skills Required: Proofreading, editing, grammar proficiency, attention to detail. - TEACHER/PROFESSOR: Average Salary Rs.7,80,000 per annum, 2-4 years of experience. Skills Required: Teaching methodologies, curriculum development, communication skills, subject expertise. - JOURNALIST: Average Salary Rs.7,50,000 per annum, 2-4 years of experience. Skills Required: Investigative reporting, storytelling, interviewing, deadline management. - SOCIAL MEDIA MANAGER: Average Salary Rs.8,00,000 per annum, 3-5 years of experience. Skills Required: Social media strategy, content creation, analytics interpretation, communication skills."
  ]
},
{
  "tag": "ba_tamil_jobs",
  "patterns": [
    "Job opportunities after completing B.A. Tamil",
    "Career options with B.A. Tamil degree",
    "Jobs after B.A Tamil",
    "ba tamil"
  ],
  "responses": [
    "After completing a B.A. in Tamil, you can explore various career opportunities in language-related fields. Here are some potential job roles, their average salaries, required experience, and skills: - TRANSLATOR: Average Salary Rs.7,50,000 per annum, 1-3 years of experience. Skills Required: Proficiency in Tamil and target language, translation techniques, cultural understanding. - TEACHER/PROFESSOR: Average Salary Rs.7,00,000 per annum, 1-3 years of experience. Skills Required: Teaching methodologies, curriculum development, communication skills, subject expertise. - CONTENT WRITER: Average Salary Rs.7,80,000 per annum, 2-4 years of experience. Skills Required: Excellent writing skills in Tamil, creativity, research abilities, attention to detail. - JOURNALIST: Average Salary Rs.7,50,000 per annum, 2-4 years of experience. Skills Required: Investigative reporting, storytelling, interviewing, deadline management. - LINGUIST: Average Salary Rs.8,00,000 per annum, 3-5 years of experience. Skills Required: Linguistic analysis, research, language documentation, critical thinking."
  ]
},
{
  "tag": "ba_history_jobs",
  "patterns": [
    "Job opportunities after completing B.A. History",
    "Career options with B.A. History degree",
    "Jobs after B.A History",
    "ba history"
  ],
  "responses": [
    "After completing a B.A. in History, you can explore various career opportunities in fields related to historical research, education, and preservation. Here are some potential job roles, their average salaries, required experience, and skills: - MUSEUM CURATOR: Average Salary Rs.7,50,000 per annum, 1-3 years of experience. Skills Required: Collection management, curation, preservation techniques, historical knowledge. - ARCHIVIST: Average Salary Rs.7,00,000 per annum, 1-3 years of experience. Skills Required: Archives management, cataloging, digitization, attention to detail. - TEACHER/PROFESSOR: Average Salary Rs.7,80,000 per annum, 2-4 years of experience. Skills Required: Teaching methodologies, curriculum development, subject expertise, communication skills. - HISTORICAL RESEARCHER: Average Salary Rs.7,50,000 per annum, 2-4 years of experience. Skills Required: Research methodologies, critical analysis, archival research, writing skills. - TOUR GUIDE: Average Salary Rs.8,00,000 per annum, 3-5 years of experience. Skills Required: Knowledge of historical sites, storytelling, public speaking, customer service."
  ]
},
{
  "tag": "ba_economics_jobs",
  "patterns": [
    "Job opportunities after completing B.A. Economics",
    "Career options with B.A. Economics degree",
    "Jobs after B.A. Economics",
    "ba economics"
  ],
  "responses": [
    "After completing a B.A. in Economics, you can pursue various career paths in economics, finance, research, and policymaking. Here are some potential job roles, their average salaries, required experience, and skills: - ECONOMIST: Average Salary Rs.8,50,000 per annum, 3-6 years of experience. Skills Required: Economic analysis, forecasting, statistical analysis, critical thinking. - FINANCIAL ANALYST: Average Salary Rs.8,20,000 per annum, 2-5 years of experience. Skills Required: Financial modeling, investment analysis, risk assessment, analytical skills. - RESEARCH ANALYST: Average Salary Rs.8,80,000 per annum, 3-6 years of experience. Skills Required: Research methodologies, data analysis, report writing, attention to detail. - BANKING PROFESSIONAL: Average Salary Rs.8,50,000 per annum, 3-5 years of experience. Skills Required: Banking operations, financial products knowledge, customer service, numerical ability. - POLICY ANALYST: Average Salary Rs.9,00,000 per annum, 4-7 years of experience. Skills Required: Policy analysis, policy development, stakeholder engagement, communication skills."
  ]
},
{
  "tag": "ba_political_science_jobs",
  "patterns": [
    "Job opportunities after completing B.A. Political Science",
    "Career options with B.A. Political Science degree",
    "Jobs after B.A Political Science",
    "ba political science"
  ],
  "responses": [
    "After completing a B.A. in Political Science, you can pursue various career paths in politics, public administration, journalism, law, and advocacy. Here are some potential job roles, their average salaries, required experience, and skills: - POLITICAL ANALYST: Average Salary Rs.8,50,000 per annum, 3-6 years of experience. Skills Required: Political analysis, research, public policy knowledge, critical thinking. - PUBLIC RELATIONS SPECIALIST: Average Salary Rs.8,20,000 per annum, 2-5 years of experience. Skills Required: Communication skills, media relations, strategic planning, crisis management. - JOURNALIST: Average Salary Rs.8,80,000 per annum, 3-6 years of experience. Skills Required: Investigative reporting, writing skills, interviewing skills, knowledge of political landscape. - LEGAL ASSISTANT: Average Salary Rs.8,50,000 per annum, 3-5 years of experience. Skills Required: Legal research, writing, case management, attention to detail. - POLICY ADVISOR: Average Salary Rs.9,00,000 per annum, 4-7 years of experience. Skills Required: Policy analysis, strategic planning, stakeholder engagement, communication skills."
  ]
},
{
  "tag": "bsc_sociology_jobs",
  "patterns": [
    "Job opportunities after completing B.Sc. Sociology",
    "Career options with B.Sc. Sociology degree",
    "Jobs after B.Sc Sociology",
    "bsc Sociology"
  ],
  "responses": [
    "After completing a B.Sc. in Sociology, you can pursue various career paths in social work, human resources, counseling, research, and community development. Here are some potential job roles, their average salaries, required experience, and skills: - SOCIAL WORKER: Average Salary Rs.8,50,000 per annum, 3-6 years of experience. Skills Required: Counseling skills, empathy, communication skills, advocacy. - HUMAN RESOURCES SPECIALIST: Average Salary Rs.8,20,000 per annum, 2-5 years of experience. Skills Required: Recruitment, employee relations, training and development, HR policies. - COUNSELOR: Average Salary Rs.8,80,000 per annum, 3-6 years of experience. Skills Required: Counseling techniques, active listening, empathy, confidentiality. - MARKET RESEARCH ANALYST: Average Salary Rs.8,50,000 per annum, 3-5 years of experience. Skills Required: Data analysis, research methodology, critical thinking, communication skills. - COMMUNITY DEVELOPMENT OFFICER: Average Salary Rs.9,00,000 per annum, 4-7 years of experience. Skills Required: Project management, community engagement, stakeholder coordination, problem-solving."
  ]
},
{
  "tag": "jobs_after_10th",
  "patterns": [
    "Job opportunities after completing 10th standard",
    "Career options after 10th",
    "Jobs after 10th class",
    "10th standard jobs",
    "10th students",
    "Career options for 10th students"
  ],
  "responses": [
    "After completing 10th standard, there are several career options and vocational courses available for students. Some of the potential job opportunities include: - OFFICE ASSISTANT: Average Salary(LPA) Rs.2,50,000, Entry-level position. Skills Required: Basic computer skills, communication skills, organizational skills. - RETAIL ASSOCIATE: Average Salary(LPA) Rs.2,20,000, Entry-level position. Skills Required: Customer service skills, sales skills, basic math skills. - DELIVERY PERSONNEL: Average Salary(LPA) Rs.2,30,000, Entry-level position. Skills Required: Time management, physical stamina, familiarity with local areas. - DATA ENTRY OPERATOR: Average Salary(LPA) Rs.2,40,000, Entry-level position. Skills Required: Typing skills, attention to detail, basic computer skills. - DOMESTIC HELP: Average Salary(LPA) Rs.2,00,000, Entry-level position. Skills Required: Cleaning skills, cooking skills, reliability. These figures are approximate and may vary based on location and individual factors."
  ]
},
{
  "tag": "jobs_after_12th",
  "patterns": [
    "Job opportunities after completing 12th standard",
    "Career options after 12th",
    "Jobs after 12th class",
    "12th standard jobs",
    "12th students",
    "Career options for 12th students"
  ],
  "responses": [
    "After completing 12th standard, students have various career options and courses to pursue. Here are some potential job opportunities and vocational courses available for 12th students: - CUSTOMER SERVICE REPRESENTATIVE: Average Salary(LPA) Rs.3,00,000, Entry-level position. Skills Required: Communication skills, problem-solving skills, patience. - DATA ENTRY OPERATOR: Average Salary(LPA) Rs.3,20,000, Entry-level position. Skills Required: Typing skills, attention to detail, basic computer skills. - RETAIL SALES ASSOCIATE: Average Salary(LPA) Rs.3,20,000, Entry-level position. Skills Required: Sales skills, customer service skills, product knowledge. - TELECALLER: Average Salary(LPA) Rs.3,00,000, Entry-level position. Skills Required: Communication skills, persuasion skills, patience. - GRAPHIC DESIGNER: Average Salary(LPA) Rs.3,50,000, Entry-level position. Skills Required: Creativity, knowledge of design software, attention to detail. These figures are approximate and may vary based on location and individual factors."
  ]
}


  ]
}
